[
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Why the battery is draining so fast in this model. Never faced problem with any other Redmi mobile\n\n  \n"},
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Owsm phones value of money\n\n  \n"},
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Nice phone only demerits is that screen size is a bit small and speaker  is a bit noisy\n\n  \n"},
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  amazing phone... Slim beautiful.. No words... Thanks amazone for timely delivery\n\n  \n"},
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Front camera is not working, why and what to do? Will you replace other one please?\n\n  \n"},
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Charger cable was not properly fitted in the mobile and i was facing difficulties while charging the device.Earphones were also not provided inside the box.\n\n  \n"},
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Good phone in this price better  performance redmi 6 double camera fingerprint  charger is so good battery backup is best\n\n  \n"},
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Very pathetic battery. 100% battery Drains in 1 hour. I called customer care to return but they said only replace and again I got new peace and that also same issue, please don't buy these model.\n\n  \n"},
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Hi Guys, I would like to share my experience after using this budget phone for almost three weeks.A) The phones looks a bit premium when compared to the price paid and looks stylish. You can use a back cover for extra safety.B) The update of MUI 10 OS after unboxing have made the phone navigation more fluidic and easy to use.C) Touch response over screen is cool and finger print detection takes just fraction of second to unlock or activate any set of commands.D) Face Unlock feature in this price range is really a premium thing we can boast off and it works well without any delay.E) Camera clarity is above average and do justice to the megapixel it claims. The portrait mode adds blur and make a good picture if you are in a well lit environment, or else it simply blurs portion of the space around the subject.F) Though preset ringtones are similar in sounds, the clarity is well good to be noticed even in nosy environment.G) Thankfully the heating issue is completely absent on normal usage of the phone. Anyway gaming for more than 1.5 hours adds a little heat in time.H) Have been using the phone for almost three weeks now and it haven't hanged or crashed even for a single time.I) Have a bunch of MI apps which you may not use and hence its better to disable or uninstall them.J) Battery backup is really good and it will last for 1.5 days on moderate to heavy usage.K) Lacks fast charging feature and hence take almost 2 hours to get fully charged.L) The phone doesn't come with a headset and hence you have to buy it separately.M) In overall a good budget phone with latest features.If my review was really helpful for you in knowing more about the product , please click YES. Thank You\n\n  \n"},
{"Brand": "MI", "Model": "Redmi 6 (Black, 3GB RAM, 64GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Mobile is cheap but camera quality is not much good as expected, UI is good .Heating up is a issue with Mi phones so with this phone it's the same, but using back cover can solve this problem and then there will be no difficulty using it.Over all phone is quite good in 7000₹range comparing to other brands .\n\n  \n"}
]