[
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  All are okk but mobile heating problem so high.I suggest you guys plz don't buy this device.\n\n  \n"},
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Hi guys,In general the phone is nice and does manages to provide you the feeling of a premium phone. However there are some flaws which I witnessed over my experience till date. So let me provide you the Pros and Cons of the phone -PROS...1. Nice built quality and comfortable to hold.2. Excellent performance.3. Symmetric stereo speakers. (Better experience while watching videos or playing games)4. Nice camera with with very good quality low light or night photography which still many flagship phones lack.5. Up to the mark 90Hz refresh rate display.6. Amoled screen brightness is excellent and there is no issue in viewing display even while the display is directly facing towards the sun.7. Excellent charging with 30 watts wired and wireless charging. I tried charging the phone from dead 0 to 100 and achieved it just under 1 hour. (In my personal opinion I don't think higher charging wattage like 65 watts is good for phone battery and sounds like a gimmick as even though they have double the wattage they usually charge a phone of smaller battery about 4000 mAH in about 40 minutes which is not much of a difference. )8. Super steady video from rear camera because of presence of both EIS & OIS.9.Bigger battery 4780 mAH as compared to other flagship phones.10. Doesn't misses out on any feature like reverse wireless charging, 5g support (though in India not of use for at least couple of years), NFC, Dual GPS, capable of being connected to wifi and provide Hotspot simultaneously, No MIUI ads till date.CONS...1. The limitation of resolution of the screen FHD+. The bigger size of the screen results in lower ppi and thus stands nowhere near QHD+ displays.2. This phone comes with Global MIUI 11 and has Google dialer and messaging app thus misses out features like call recording, phone notes etc. (Reason being in many countries like UAE it is illegal to have call recording apps or VPN apps. )3. Trust me this MIUI has a lot of bugs and thus results in issues like while using finger print scanner, the device heats up at times even during normal usage, but the overall performance is acceptable. (Hopefully most of the issues will be resolved by MIUI 12 update which is going to be available soon)4. Outdated front camera and supporting rear cameras hardware. (The 20 MP front camera and that too without EIS, 2 MP macro camera, 2 MP depth camera and 13 MP ultrawide camera seems like a joke for a 2020 flagship phone with the price of 50k.)5. The battery is bigger compared to many devices but looses about 10 to 20% even when left untouched overnight thus I'd say not so good battery management.6. Misses out a 3.5 mm Jack and also the c type to 3.5 mm Jack converter provided in the box doesn't seem to be of a very good quality as per my initial impression.7. Though the low light photography is good but daylight photography is not that exceptional as one might expect from 108 MP camera.8. I felt that the call quality is not up to the mark. (Maybe just in my case)Pricing issues - Though there are two things which have gone against Xiaomi as well as other Mobile brands1) Increment in GST rates from 12% to 18%2) Higher import duties for imported phones.I think that the phone is slightly overpriced at 50k but if we compare it with it`s biggest competitor the One plus 8 I will always choose MI 10 as so many things are missing in One plus 8 (like wireless charging, LP DDR RAM 4x is present instead of 5, comes with smaller battery 4300mAH and Sony IMX 586 Camera sensor which is quite outdated now) and have a price difference of only 5k.  Even that can be narrowed down by using bank offers if available which was there in my case. However in comparison with One plus 8 pro I feel that MI 10 is slightly behind because of the MIUI bugs related flaws, FHD+ display and outdated secondary camera hardware (including front camera. Thus I believe that if the aforementioned issues would have been addressed by Xiaomi I would have considered this phone justifying the price completely and without a doubt would have been the best phone ever under 50k. However in reality still the phone is definitely a strong competitor in the flagship mobile segment.\n\n  \n"},
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Heating problem.....waste of hard money....go for other phones in the same range......\n\n  \n"},
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n   outer packaging was intact, but inner box seal was found broken. It was certainly tampered ( photos are attached).\n\n  \n"},
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Ist very bad\n\n  \n"},
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Keeps hanging. The seals on the box were broken and the performance is not as was expected.\n\n  \n"},
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  OverHeats and battery drains quickly... performance not what you expect from a 50k phone.\n\n  \n"},
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Not a good quality product facing problem in Mic of this phone I have tried several calls but most of them having voice issues as well as this phone is having overheating issues\n\n  \n"},
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This mobile is not good , so many problems hanging , heating . Don't buy waste of money\n\n  \n"},
{"Brand": "MI", "Model": "Mi 10 (Coral Green, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  A cute mobile...super performance and good camera\n\n  \n"}
]