[
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Awesome mobile at this price point\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I simply liked it when i unboxed it and saw it at first glance. Its 16.15 cms display is quite impressive. Most of the time i watch movies while travelling to and from office . Hence I can have a better screen view now. The camera is also excellent.Overall a nice phone within a nominal budget. I’ll give it a 5 stars for now.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I was looking for a budget smart phone which can perform the entire task for me. I was using MI note 6 and looking for something fresh bcz I was bored with it’s UI. I explored the content available over internet and waited for it to buy after getting the right fitment against my requirement. I am so excited to share my personal experience after my early purchase of this device. I love taking pictures of mine and surrounding too. So great camera quality is one of my main priority, after using it now I must say that it has the best camera available in this budget.It’s plastic made but mirror finish back panel is the coolest thing in my blue colour device. I also appreciate the makers for understanding our further need and offering the tempered glass and transparent back cover for device protection. Once you will keep the device handy it will give you a feel of it. With the brand tag line of Vivo “Camera & Music” it really impressed me.I’ll surely recommend my fellow buyers to buy this cool device. But there is also something which can be improved so writing it in bullet points for your ease..Pros:-● It’s really a 100% value for money device.● Run on latest version of Android “9”.● In Box soft back cover and tempered glass.● Dedicated kid mode for safety against unwanted operational activity of kids● Finger print sensor in back of the device is at perfectly placed in the reach of fingers and open the device faster.● 5000Ah battery, allows to watch many hours online video● HD+ screen Resolution and balanced colour contrast makes the viewing experience really pleasure and never hurt eyes● Triple camera with AI and image editing options are among the best features for me● Fast charging support with 18 watt inbox adaptor● Snapdragon 665 processor is really a power pack performer even in multitaskingCons:-● Lags in PubG (However in a device with 4 GB it’s expected as the game itself take 2 GB space)● No headphones included● Front Camera struggles in low light.At the price of 10990 its a great phone for better multitasking. Vivo has finally started improving specs and is doing good with their phones in the segment.I hope my review helped you in making your right decision!\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The device is too heavy don't go for it. Also it lags a lot despite having a Snapdragon processor of 600 series with 3gb 64 gb storage.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Nice looking and very nice phone Battery is good and ... camera is good\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Good phoneBut camera is ok\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Do'nt go for it i received it today, totally disappointed from camera quality provided by vivo,MI 7s & reamle u1 better than it.if u go for camera quality & display never go for it\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Nice phone under 9000\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It's an overall package. Built quality is very good\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo U10 (Thunder Black)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Vivio U 10 is a descent  phone it has some pro and ConPros:i) Great Battery Backupii) Faster app openingiii)Good MultitaskingCons:i) Poor Camera, No Portrait option in Front cameraii) Too many notificationiii)cant uninstall app from screen directlyyou have to go app settings option.\n\n  \n"}
]