[
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  First impression is its an absolute beauty.My personal review regarding OnePlus 8 Pro Ultramarine blue after using 24 hrs.Display:A stunning 120Hz display. Better brightness, even bright in low light also. No green tint / black crush issue found on my device.Camera:It is clear that only 3 rear camera are working right now. No color filter is working. It may redeaign and enable later via software update.Rather than every sensor of all camera working fine. Pictures taken by rear camera with all mode is so bright that u can find every details in the pictures.48 MP wide angle camera is take so wide and beautiful pictures.On front camera section it take good bright pictures, but i think in portrait mode it take little bit artistic image than real.Slow-Mo working fine. Macro working fine.Battery:Battery backup is good. 30 W Warp charger  chage the device very fast. 19 hrs before charging and its still 6 hrs left. Screen on time is approx 8 hrs.No wireless charger so dont know about wireless chaging.Oxygen OS:This is my 3rd OP devices and the best part which i love is its Oxygen OS. Everything nice. I personally want more Font style.OnePlus own gestures is also missing this time.Proximity sensor working fine. Pocket mode working fine. Fingerprint sensor is superfast. Face unlock also superfast.Sound & Vibration:Sound is good but i think ring volume is little bit low.Speaker is loud, you can use Dolby Atmos enhancement also. Heptic feedback is low which is good.Live Captions features is new this time.Network:OP 8 Pro not support our own navigation system NavIC right now. No announcement from OnePlus also. Qualcomm announced that its 865 Snapdragon processor support NavIC system. So dont worry ur hardware support NavIC. Maybe software update comes later.Screen guard/Back cover:Use CaseU tempered glass or GlazedInc tempered glass. Both r good and accurate fit.Use original karbon fiber/ sandstone case or use Ringke/UAG/Spigen case.If u interested to buy from Ali express then buy Nillkin back cover.Thank you.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Good:PerformanceLooksMain CameraAverage :Ultra wide, Telephoto and selfie cameraBattery lifeBad:Heats quite a bitWeight balanceUgly :Display. Black bar, green tint, non-uniform colors at lower brightness, black crush even after update.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Received my OnePlus 8 pro (12GB+256GB) today and it is an absolute beast  thanks to Amazon for fast delivery and also 3k discount using SBI credit card.ProsSnapdragon 865 best chipset available for AndroidStunning 120hz displayExcellent battery life30watt warp chargeWireless chargingIP68 ratingImproved camera quality5g supportUFS 3.0 storageBest in class Android skin (Oxygen OS)No display issues in Indian unitsConsphotochrom filter disabled ( I really wanted to try that one )Curved edges cause accidental touches ( I hope they will fix it in new update)Overall a true flagship from OnePlus\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Don't buy this phone!oneplus company released fake updates for color filter camera in which camera is useless and not taking images like before.Its totally useless now which forces us to take pictures outdoor only.And all new updates give more issues, no hearing from oneplus side and they are just ignoring.I attached old and new camera photochrom filter images.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Recieved a defective display\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It wasn't expected from one plus,I am facing the same issue which is experienced by most users on one plus 8 pro ,something which is called black bar issue near front facing camera when brightness of the phone is set to low,really not expected one plus.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The phone was good but the display was so BAD with so many issues like Red Tint (120hz), Green tint (at 60hz), Black Bar beside camera, Image retention.Returned mine, this was my First and LAST oneplus phone. Thanks OnePlus for the amazing experience.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I've been using OnePlus 3 more than 4 years and it was time for an upgrade for obvious reasons. It was no brainer for me to go for a OnePlus device again as OP3 is still running fine and strong (although it does not handle the newer games like CODM fine anymore). Believe me guys, Oxygen OS is by far the best skin for Android.Now, coming to OP8 pro, I've used it for a day and I can say that it didn't disappoint me. Following are some of my observations.- Display is stunning, probably second to none.- Oxygen OS is still just awesome.- Haptic feedback while not the greatest, is still very good.- Even though the phone is heavy, I feel it's very well balanced. Very difficult to use with one hand.- Fingerprint scanner and Face unlocks works like a charm.- Design is great and the available color options are different and awesome.- Earpiece volume during calls are not the greatest but adequate. OP3 earpiece volume had deteriorated very much over time.- Rear Camera has improved a lot, but I can already feel that there are still rooms for improvement. Focus jumps quite a lot in tricky lighting. Need to do an in-depth testing. Also, the camera bump is quite prominent.- I did not find any green tint or black crush issues as reported by some International users as of now. But I can see a black bar running parallel to front camera module under the lowest brightness setting. But again I would suggest not use in full/high brightness all the time. Also, watch YT videos in landscape mode.- Lack of the 3.5mm headphone jack is the biggest let down for me in this phone.I'm yet to test a lot of things, will update after a few days of usage.Writing the review from my new OP8 Pro, it just feels great. The Ultramarine Blue is fantastic 😍.Finally, if the price is not a deal breaker, then I *Highly Recommend* this \"Flagship\" phone from OnePlus.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Not happy. I am a long time customer of oneplus phones and since last 3 years I have been using oneplus 5 and that phone is as good as new. Here are some of the issues I am facing with the new onplus 8 pro.- Battery - The phone doesn't last one day with full charge. I dont play any games, my phone usage is mainly social media, instagram,facebook,reddit, twitter and bunch of other photo edit tools like lightroom and snapseed. If I charge full and start my day, then by evening 8pm  my phone is battery saver mode. Which is not the case on my oneplus 5 even after 3 years. It lasts comfortably until night one one charge. Yes war charging is faster, but the charge which doesn't last one full day is conerning for me. Since I travel long distances most of the days. And its more concerning because I don't use any of the power hungry games or apps. Btw I have removed 120hz refresh rate on the first week itself and all this battery issue is even when I am using it at 60hz refresh rate with default app/battery settings.Overheating - This is again a strange issue. I bought the oneplus 8 pro selling my DSLR camera so that I can record all my videos on phone itself plus its waterproof. Recently I shot a video at 4k 60fps and I guess within few minutes the phone got so heated that it disabled the camera from video shooting until the phone cooled down!! Now whats the use if I cant record a video even for few minutes straight on 4K?Camera - To be honest, stabilization is really great while recording video however photos are almost as good as oneplus 5 if not slightly better. But nothing that worth paying double the price you pay over oneplus 5. Video clarity is really great, far better than the oneplus 5. Wide angle is the only thing I felt is worth compared to oneplus 5.Apart from the above rest of the things are good I feel. Especially look and feel, screen is really good. Even the build quaility feels nice. Tested in rain couple of times and it worked great. Fingerprint lockscreen works mostly 70% of the time.Overall I regret buying the phone. Even if they had fixed the battery issues, this phone would have been a great choice.AnnyArun\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Ultramarine Blue 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  There is an uneven brightness issue where the green tint is easily visible, uneven colour calibration is present.Had invested in a wrong premium phone. Seeking some solution from oneplus or amazon after buying it on 17th June. Very sad to oneplus for the first time.\n\n  \n"}
]