[
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Firstly, I am glad I have purchased this phone!For people confused between xs and xs max, take the xs, why? because xs max doesnt give you more screen space, it just enlarges the icons and the text. Even after upgrading the ios to 12.0.1, there seems to be no difference, I think the screen could have been used to fit in more text compared to the Xs. having said that, im used to big phones, the Pixel 2xl, the 6sPlus, so if you are a big phone person, go for this phone with eyes closed.If you are confused between apple and android flagships, let me tell you, I was on HTC for 3 years, then shifted to iphone 6s plus for 3 years and briefly shifted to pixel 2 xl, and  now finally to Xs Max, which I intend to use for the next 3 years. having used both, I definitely feel iphones are quite premium and offer the best tech. I mean when I think about it, who invented face ID? who designed the notch? Almost all phones come with these features these days and after adapting to iphones technology, the other phones are going a step ahead, so definitely, apple is the trend setter! Comparing pixel 2xl with Xs Max, I found that the pixel 2 xl and even the pixel 2 get damn hot, definitely not the issue on the iphone. Iphone looks much better too! GREAT DISPLAY! Also great touch interface! its really smooth. Having said that, Its all personal choice!I really love my purchase! and now I know why some people are reluctant to switch to android from iphone!\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The iPhone XS Max combines a big OLED screen, great speakers, great cameras, great battery life, and blazing fast speed into the best user experience on a smartphone. For the record, Apple will support this phone with software updates for 5 years...the Note 9 is a 2018 phone running 2017 Android software and Samsung gives software updates for 3 years. I’ll list some pros and cons and also what the tech media won’t tell you.Pros:- battery life is all day- upgraded speakers get real loud- Face ID is faster- fast and smooth- Siri has been given shortcuts- upgraded cameras are just as good as Samsung cameras now and the front camera is better than the Note 9 front cameraCons:- expensive- slow speed charger- no headphone jack- it’s made of glass on the front and back. A case is almost mandatory especially if you are clumsyBottom line...the iPhone and Galaxy phones are the best phones on the market right now. The iPhone is a step ahead because iOS gets frequent updates and starting with iOS 12 Apple actually sped up old iPhones and iPads which will allow users to keep their devices longer. An iPhone is now like a laptop and something you only need to upgrade once it breaks. The iPhone is also the ONLY smartphone that can stream all video apps in full screen. Android doesn’t have full screen built into the OS so video apps like HBO, Showtime, Cinemax, STARZ, Encore, and EPIC are all tiny on the Note 9...those apps are all full screen on the iPhone. Food for thought.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Despite ordering the world class mobile, vibration function is not working since day one. Had gone through blogs and there was hope that it be a software issue and will get fixed. But unfortunately 2 months are over and even with the latest iOS 12.1.2, vibration function not working. I work in Nigeria and now do not know how to get it replaced.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Superb iphone battery life is soo good buy it for 104000\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Great phone and easy gestures. Camera is good and screen is excellent. Attached Some of the pics for assessing camera and software at work.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This is my third iPhone and 7th in the family which also owns iPads, MacBooks, iPods and iWatches. All i can say we cant get away from Apple.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It’s an iPhoneGold colour colour done the job very wellA12 Bionic chip processor is strongBuilt quality is good then iphone xr and iphone 11Camera perfectPeople will love this 2camera design not the iPhone 11 pro max design\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It's not worth itThe features are okishIt's pretty smoothBut at this range everything is smooth:-=-OI am more happy with the performance of my note 9Go n buy apple airpods n a note 9 or one plus 6tThis is just a waste\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Not doubt, it is expensive and luxury product.However you will have experience of different levelFrom 6.00 am to 12.00  pm it consumes 80 % batteryI could say only one thing if have drove super bike like Harley Davidson or super car like aston, then only u could understand difference in experience between Aston/Harley to maruti800/splendor\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone Xs Max (64GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It’s a must upgrade from iPhone 5S to iPhone 7. Excellent speed and battery life and everyone knows about camera quality. No doubt those who can’t afford it will never have a chance to use this phone. These people are everywhere crying out loud about price tag, but once you buy it and use it you will know it’s worth. Amazon is excellent in delivering packages securely to customers.\n\n  \n"}
]