[
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Nice mobile.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Good\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Nice product\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Terrific quality and it's one of the best model in. Vivo.... Battery capacity aswm\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I was looking for a phone to be gifted to my mom... But below 10k the configurations and brands weren't enough pleasing but then when I found Vivo it was just so perfect.The color of the back side of mobile is so elegant,the camera quality is also very good, clear and battery life is great.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This is a review as a moderate user.1. Agate red is stylish......2. Battery life stands three days with moderate gaming of aproximate 1 hr per day (free fire) on low power mode.3. Camera is ok for this price range.4. Dispay is good.5. Gaming performace is good when playing freefire in smooth and standard settings.6. There are lots of feature in this phone like low power mode, ultra power saving mode, game mode, one hand mode, etc... Check YouTube videos for the features.7. Finger print reader and face recognition is fast. I prefer finger print and turn off face recognition for saving battery life.8. The best thing is, I bought this phone using amazon paylater for zero emi for three months.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Just wow. Beautiful red colour vivo y11.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I bought it for my mother, she uses to make video calls and surfing YouTube. Ideal for basic use. The pricing could be 1k less for this kind of configuration. Over all good product if you are not going to play games and keep cleaning junk from your phone. Like other vivo phones it also has unwanted advertisements.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Superb battery backup, till now no hanging issue noticed. Very good mobile for the basic users. Camera quality is average and u can see noise in the picture taken. Finger print sensor & facial recognition works well even with mask on. No issues with the mobile network & 4G data connectivity, data reception is very good. But WIFI part works slow with 75 to 90 mbps line showing on other handsets & laptop, this mobile will show only 10 to 11 mbps max.Overall good mobile for basic user.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y11 (Mineral Blue, 3GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Mobile VIVO 11 is badly programmed in setting and SIM PLACEMENTS ,IT OFTEN GETS PUK LOCKED ANYHOW TWO THREE TIME I GOT IT OPENED BUT AFTER LOCKING OR MAKING IT OF AT NIGHT IN THE MORNING IT CLOSES BY PUK CODE TO OPEN WHY SO BADLY PLANNED NOT CONVINIENT AT ALL TIRED IN TWO DAYS FOR PUK AND ADVERSLY SIM POSSITIONS IN PUTING ANF USING IT BAD PURCHASE FROM AMAZONE THIS TIME UNHAPPY TOTALLY\n\n  \n"}
]