[
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Don't buy this MI 6 Pro ,Speaker volume is very bad & LowCamera pics are not good at all special back cam having dual cam stabilization problem front cam like VGA picsHeating issueBattrey drained very Fast\n\n  \n"},
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Cheap Chinese product.Negatives:1. Mobile network signal reception is very weak and says service unavailable.2. Slow charging3. Overheating4. Internet speed too slow5. Display width is too small( Feels like 5\" display)6. Cameras don't have clarity7. 4g signal is weak8. Mentioned made in India but says frequently used apps as alipay, qq, etc., which are Chinese apps9. Tried to get replacement using smartchk app but it responds like a Chinese electronic voting machine(Votes for Redmi:Says mobile works well)10. So no replacements if mobile has quality issues!!!!Worth only half the price .ie. ₹4500/- only, since we have to get adjusted to low quality...\n\n  \n"},
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I got this product and face below issue in 4 days.1) Couple of times the Phone gives a ECHO to the Listener on the other end and couple of time to me also.2) The charger get hot when you keep it on charging.Other issues.1) I was using Asus Zenphone2 of 2015 Model with same ram and Internal Memory,but this phone is really very slow in loading web pages an even your tube.2) The network keeps on fluctuating.Badluck:I got in the trap of Amazon Policy saying that we cannot get refund , we can only give replacement. I would request all the user to kindly be careful when you are buying the product. Amazon very smartly mention at only one place that you can get only replacement and not refund.So the user has not other option left just to get the product replace.Conclusion for me.I can only pray that the product work atleast for 1 year and the replace product doesn't have the technical issue and i dont have to run behind the service center.I will definitely AVOID buying products from Amazon. Save  my money as I was planning to go for Prime membership.\n\n  \n"},
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Display quality is top notch, overall the quality of the phone is very good. All metal body. Camera is good too. Touch smoothness is amazing. I will definitely recommend to buy this phone.The USB is not type C, it is the old one. This is the only con that i found till now. It has got 2 nano sim slots and a dedicated memory card slot (2+1).Other than the phone, amazon delivery service is a bit let down. It took 6 days to deliver the item from Calcutta to Assam. Whereas last year i bought 2 Redmi Note 4 ( for me and my uncle) from flipkart and mi india website, if you recall, Mi had flash sale every Friday. Hence i bought both handset on different dates. To my surprise i placed the order on Friday and received the item on Sunday on one occasion and Monday on the other occasion, which the shipped through ekart and FedEx respectively. Merely in 2-3 i got my phone. But Amazon's courier service is a total letdown as compared ekart and FedEx.\n\n  \n"},
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  \"Phone's Temperature\" if talk or surfacing internet, phone will be hotter.....Hanging continuously...Have a point on the screen..... If we talk much more time u could be tempted because of phone radiation... Etc...  This phone is not good like Redmi 5pro\n\n  \n"},
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Very nice phone for average users, very good battery backup,no lagging or hanging, good screen, size also handy.Camera is disappointing, not good for camera lovers. MIUI is not that good as pure android.Overall if you need a good phone for day today task with good battery and within budget, this is perfect.\n\n  \n"},
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The Red color looks tacky. Guess I should have bought black instead. The phone feels somewhat cheap in red to be honest. I understand Xiaomi did not supply headphone with this phone. I also feel they should have not supplied with the cheap *** and flimsy phone case (Its an insult lol).  Why even send it. Its very generous of Xiaomi India !! Thank you so much (If I will spend Rs.600 on a head phone then surely I can spend another 200 on a half decent phone case).The screen is awesome!! So is the battery! User interface is not confusing unlike other brands but I will miss Google Now Launcher which gives lesser mortals feel of stock android (Google stopped providing for newer Android OS). Camera is good.This is my 1st Xiaomi phone and I am somewhat happy (damn you red color) with it. And maybe I had higher expectations on the back panel.\n\n  \n"},
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Awesome mobile. I recently switched from MotoG3 to Note 6 PRO. Its really a different experience. Using for last 24hrs and still my battery is 70% left with medium usage of 4G. Worth to buy and use.. Thank Amazon for quick delivery. Thanks Redmi for worthy mobile in such a attractive price..\n\n  \n"},
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  About the phone:Android Version:*Android v8.1 (Oreo) based on MIUIPerformance*Snapdragon 625 battery efficient*Octa Core, 2 GHz processor*4GB RAM enough for daily useDisplay*5.84 inches (14.83 cm)*1080x2280 px, 432 PPI crisp display*IPS LCD beautiful colourCamera*12 MP + 5 MP Dual Primary Cameras*LED Flash*5 MP Front CameraBattery*4000 mAh 1 day+ battery life*Non-Removable*4G Supports Indian bands*VoLTE*64 GB + 256 GB Expandable*Dual SIM: Nano + Nano*Dedicated Micro SD Slot*Fingerprint sensor*USB OTG SupportReview:Overall the phone feels bit heavy given the small form factor, which indeed feels good in hand. Camera performance is average. Processor SD 625 is aged not the latest (but still good). Battery life is sufficient. SIM ejector pin is too small may get lost (careful!). Has got a notification LED on bottom. Has most of the decent sensors (Compass, Step, Gyro etc.). Has IR Blaster.The phone looks identical to other Redmi phones. The display is the main attraction.Overall performance is average, don't expect huge from this phone at this price segment. Good for average user.\n\n  \n"},
{"Brand": "MI", "Model": "Xiaomi Redmi 6 Pro (Rose Gold, 3GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This is my 4th Xiaomi phone in last 3 yrs and this is the worst one I got. This phone is a mess. I am not sure why Xiaomi is not fixing the issues on this phone. I wasted my money on this. This has got horrible cons like:1. this phone will never show you notificaiton icon at status bar. So basically, you will get a sound or vibration that something app has got a notification but you cant see at the phone screen top status bar which is something a 3rd class phone also shows. So this means you will have either have to slide down the top of screen to check the hidden status bar or foolishly keep sliding and check which App has a notification. Worst experience.2. Screen is sluggish  to navigate, slow one.3. Sound out put is not that good.4. Camera is average.5.MIUI being 9.6 is very disaapointing and not user friendly. I was using redmi note 5 pro and it was far better.  I bought this one just because of smaller size to easily fit into pocket. i am regretting now.Verdict: Better go for redmi note 5 pro and avoid this one atleast.\n\n  \n"}
]