[
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The phone has a dark band on the status bar. As clearly seen in the photo. OnePlus 8 pro has some serious issues with its display. To reproduce the issue, you have to sit in a dark room with the lowest brightness possible in your device.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I am facing display issues in low brightness\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  i am using this phone just a day..but there are  two main problem i notice so far...one is in video black depth is more and the second one is adapive light censor is worst part.in low light it's horrible.it can't match half of the samsung note,or s mobile.battery back is good far better than samsung and processor is absolutely powerful.playing pubg isn't that great experience it's lag many time.pls oneplus fixed lowlight display problem..\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  When i was testing my device for any display issues i kind of felt white colors are a bit too warm which looked like it had some tint effect to it in my unit, so i went into display settings and changed the calibration to advanced and selected AMOLED wide gamut with a cool color tone. it seemed to be good and then after a while, i started noticing image retention issue which was visible in light gray background. so i tested it keeping full brightness and opening chrome incognito mode and i could see home screen icons visible there (as shown in picture).i called in for replacement but unfortunately, i can only get a refund due to low stock of op8prodisappointed a lot in the quality of oneplus devices for which we pay 60k.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I bought the phone during the first sale on 15June.I was very excited for the phone due to all the hype on the social media and what not.It was amazing at first,blazing fast speed,120hz refresh rate and the display was gorgeous to look at,but after around 9th day,my display was having issues and after 11 days,half the screen would show a weird purple tint while watching youtube in dark mode and using chrome and apps with similar black color.My whole experience was ruined,so much that i sold the phone at ₹3000 loss.I'm 99% sure,no matter where you buy the phone,it would have some display issues in one way or another which is very disappointing.I urge you to stay away from this phone as the screen is not calibrated like it should've been.Totally not worth your hard earned money.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I bought this 12GB+256GB Glacial Green variant and physically it looks stunning. The design is top-notch. The punch hole camera does not spoil the overall screen experience as some people have said. Very sleek and premium looking design-wise. The battery life does not last really long when you use it on 120 Hz QHD+, although it's quite manageable and can get through the day with mid usage easily. Coming to gaming, I'm a hardcore gamer and can game continuously for 3-4 hours, and let me tell you this phone can run through it with ease. I've played PUBG quite a lot on this device and have not noticed any major frame drops at HDR graphics and Extreme frame rates, let alone Smooth graphics. It runs PUBG really smoothly. Stable frames at all times. I would suggest it for competitive PUBG and other games too. The 120 Hz Amoled screen is breathtaking. Buttery smooth at all times. Certainly the best display on a phone. I have found the cameras to be decent enough. Nothing too fancy, nor a let down. Videos are very stable though. This has come close to the iPhone cameras as a video shooter. This might even offer better stabilization than the iPhone videos. The colour filter camera is disabled out of the box. Speakers are fairly loud and clear. A very good surround experience. You'll find a Dolby sample video in your gallery. Play it on the phone speakers and see for yourself.Here comes the bad part about it. The phone that I had received, I used it for about 2 weeks and discovered it had this image retention issue. The afterimage of anything displayed for a period of time on the phone for a long time is displayed on the screen even after the original image is pulled off. This could be seen while watching Youtube videos in non-fill screen mode or videos that have any kind of frame visible or even games like PUBG where static elements of game like the map's frame or your controls would be visible on certain background colours even after you have turned the game off. I had reset the phone and not seen any kind of improvement. I checked on the community and many people have experienced this issue as well. The hole-punch band issue is there but it was very vague and DC dimming could fix it. Also, my screen had no green tints. The image retention issue could easily turn into permanent screen burns really soon. So, I have returned my product for now and plan to buy the same phone again.Hope you people find this review useful. Not a very organized review but that's what I have experienced.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Superb phone but little long and curves should be more.Camera and speakers quality are very goodSleek phone and color are very beautiful.Sound quality is excellent and crisp sound like u listening in head phone. u can recognize each sound in background and in surrounding without using any headphone.Picture quality is also excellent clear hd quality, colors are very bright.Camera is 48 mega and and after enlarging the image pixel not blurred.Camera quality is also awesome,slow motion,ultra wide,manvi and selfie all great.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  My oneplus 8 pro has this screen uniformity issues in low brightness.You can see red tint in lower part of screen in first 2 images and crushes in colour in third image that is even at normal brightness.There are lot of other issues. Phone always stay warm unless you sit in AC room.It heats a lot even during normal usage.During charging its heat a lot .Front camera of this phone is Just pathetic.In whatsapp video call is worse. Slight background light fades away all the details.Even with default camera app,the front camera is bad. Back camera is decent.First time i am disappointed with OnePlus.I think reviews are just hype.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Mobile display received defective, display good on features only but the greenish blurry background while night time confirms definitely the diffective display supplied by increasing the brightness to minimum.i previously used OnePlus 7pro and never seen this issues.if the minimum brightness continues as same as now eyes will go blind night time.My concern and suggestion for you to go for other models if you loves this mobile display.Don't waste money for this defective product because OnePlus company also knows this issues.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Don't waste your money in this... don't go one plus 8.. better this u can buy any but don't go for 8 series.. I got a line on front of display just in 4 days\n\n  \n"}
]