[
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Thank you samsung and Amazon for timely rakshabandhan delivery.Now for readers this is a review unbiased and written after testing and continuous usage :-Pro's1.Screen ppi is great as entry level device✌2.Battery backup is awesome thanks to samsungs R&D even with .7mamp charger.👀3.Android go version 10 is cute without craps4.Reading pdfs is easy and comfort for eyes atleast samsung has guts to say the truth.5.No lag till now because i dont need gaming other than that all regular even without go apps are nicely running.6.fingerprint and face lock i dont need so good they are not provided.7.Call quality is okay.Speaker is normal.8.For music lovers dowload any music app with equilizer will be fine.9.16gb/32gb and sd card is okay.10.Auto smart memory cleaner(use smart manager in settings once a day) for smooth RAM functioning and ROM cleaning🤗11. Supports OTG as well.Cons1. Camera below average still expected but samsung should work more on this front if they wanna beat chinese phones.2.Not for gamers and thats expected buy a 4gb Ram 🤔 based phone why reading me?😉3.finger print and face lock missing I Can manage but most indians can't.4.Battery takes 3.15 hours to charge to work for 12 hours of calling and surfing and thats not bad at all but can be issue for chinese phone lovers who have habit of charging again and again to play pubg.Overall out of 5.Camera-2  Gui-4  Screen ppi-5  speed-4  android-4Don't buy a phone only because of specifications must see integration and longevity overall a nice secondary option and primary for featured phone switchers.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Very smooth UI latest M series .Battery is good. 3000mahIt has dark mode.Apps run smoothly.Camera is average.Best for secondary phone.Apps are of GO versionWiFi calling feature.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I free of cost taken this phone for I show my friends in WhatsApp & facebook this phone a budget phone and full specification and more sell for samsung smartphones.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Its not working. Pls don't buy this phone. Listen carefully, Only on August 14th 2020 I bought this, but today 23.08.2020 its not working. I couldn't even switch this mobile on. Samsung Galaxy M01 mobile. Mobile is not worth. As today I came to amazon for return or replacement this cheater has closed the return window by yesterday. How cunning they are ? not even ten days its been since I have bought. This cheaters have closed it. Its not working now.  Even if I call toll free numbers no one responses.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The phone suddenly went completely dead within 10 minutes of switching it on after receiving it. Asked for a return, but the delivery boy didn't take the return because the phone is dead! Again request a return. Waiting to see what happens now. Can not take it to any shop or dealer as it is purchased online.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  After using 4/5 days suddenly without notice, the phone shutdown automatically and I couldn't restart it. So contact with amazon for replacing it and get very quick response from their end and they book a time slot to verify it by a technician. But after few hours later I found in start up guide send by Samsung,  how to restart when it stops working or hanged( by pressing power and volume key simultaneously for seven seconds or more). The fault is from the end of Samsung company I suppose, because they should mention the process on the front page with bold letter. Most of the reviews which get 1 star facing the same problems like of mine.  After using one month I want to add some extra points which impressed me.1. Sound quality and graphics are very good.2. Smooth touch sensitivity3. Ringtones are much louder.4.Two volte nano SIM s work fine together.5.Battery backup is good. Charging time is not so lengthy.6.Any SIM can be switched off manually, that impressed me.7. 2GB ram and 32 GB storage is better option for budget friendly people.8. I faced hanging problem for one day only till now , which can be easily solved by pressing volume down key and power key simultaneously for 7 seconds or more.8. Lastly this mobile is Made in India which I like the most.  So any one can go for it. Amazon agents are really helpful which I experienced.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Thanks Amazon for delivering the product as mentioned in the product description. It was well packed and delivered.By the way, A Special Thanks to SAMSUNG for stepping up to INDIA's needs and introducing a new Line of Phones for taking on the Chinese Incursions in Indian Mobile Phone Market.We ordered \"Samsung Galaxy M01 Core (Blue, 2GB RAM, 32GB Storage)\" and thrown away the chinese phone Salomi as it had 100 other Apps Pre-Installed without our information and heating phone and draining battery. Had a tough times using that 'Salomi' phone. Now with a GOOD / BETTER Phone from GOOD Company Samsung, happy to own this \"Little Cute Phone\".Samsung Galaxy M01 Core (Blue, 2GB RAM, 32GB Storage) -- is a small enough to keep in pockets and has all the Latest Android 10 OS with a Good Display.  -- All latest version of Apps in a lite mode which means what we need only will be loaded and given instead of \"loading all forever\" and wasting our Precious Data.-- A good Camera with Samsung Reliability is known for its Crisp Camera and Displays.What else needed in a phone. Thanks SAMSUNG for bringing a new Affordable Range with Latest Android 10 OS.Way to go SAMSUNG. Surely we INDIANS will support SAMSUNG and make it to No.1 Company by replacing the Chinese Mobile Companies in INDIA.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Not bad....can suggest this mbl for normal users.... charging speed is very much disappointed , taking lot of time to charge up ....basic charger type not even USB cable....this suits for parents only ....not for youngsters, gamers etc.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I am writing this review after the usage of 15 days. It is one of the worst phones Samsung has made with multiple issues. Me and my friend both purchased the same phone for our aunts and are facing the same issues. The main issue I am facing is that the phone switched off 2 days back and since then I am trying to switch it on but its leading me nowhere. Neither it is charging. Phone heats up while charging as well as in normal usage conditions. While charging the phone heats up to an extent that one may feel that it could blast. My friend also faced the phone off issue but it was resolved automatically after 2 days when he connected a fast carger to the phone. He is too facing the heating issue. His phone still switches off on its own again and again now and then... All we both are able to do is to regret on wastage of our money.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I have recieved this phone on 14th of August 2020 and today is 24th of August 2020.So After 10 Days i am reviewing this phone because i have seen many negative reviews on amazon review portal so now my true experience is about this phone following.1:- Processor Media tek Quad core Is best because quad core take less power from battry than the octa core processor. and i purchased this phone for my mom so quad core porcessor is sufficient to my mom.2:- Battry life is good because of Quad Core Processor.3:- Ram is 2Gb that is also sufficient4:- Display as always awesome as samsung provide.5:- Mike and Speaker's quality is too good as always samsung provide.6:- Many People said in the review that the mobile is automatically swiched off and on automatically. yes i have seen this my own only one time. but its not the problem. every new phone have done this one time because of system works smoothly. and after one time switch off on things happen then never repeated till my 10 days of use this phone. so you people who is taking switch off on problem very seriously ,you should not. this is one time process when phone is new sometimes phone may swich off and on automatically. so dont panik at all for this.7:- most of the people want to replace the phone because of one time switch off on problem then i have to say one thing that your first phone is the only phone who is brand new and the replaced phone never be a new phone at all . so never replace your new phone. this is my own experience.8:- I am fully satisfied from this phone in this price of 6499.9:-This is all the reason that is why i am giving 5 star this phone.Thank U Samsung.\n\n  \n"}
]