[
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This phone makes sense only for a very specific set of people. Bought this after a lot of deliberation on whether to go the one plus way or the oppo find x.  I am a person who uses an S9, and super heavy user. Atleast 2 full charges a day. Not for games but professional use. emails, conf calls and video.Chose this one barely on three factors.In 30 min you get near full charge. This phone is worth for that one reason.Screen, a 120hz screen does make a huge difference compared to S9 that I own.Speaker - One of the best speakers.Plus 5k discount and a one-time screen replacement warranty.Cons - The charger shape is not ideal. If I plug it in, it interferes with the next plug point or the switch. Should have been lighter and the cable should have been higher quality.ColorOS 7.1 actually turned out to be way better than I thought. It is minimalist, material design, and fast. But still should have provided an option to remove the few remaining out of the box apps.I don't worry about IP68 and Camera. In the last 15 years, I have dropped the phone only once in the pool, but at least 5 of them have got a broken screen.  I don't use the camera on the phone much. So that was never a factor.I just looked at how I have used the other phones for the last 10 years and counting what made sense for my usage leaving all other things out.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I Can't even think at any point of time that it's been that easy for me to Back to Android after using Iphone 11.But after using Oppo Find X2 my thoughts were totally blown away by the performance I got. I Just Loved the Build Quality and can’t Even tell u about the display but I can tell u one thing that Oppo Find X2 has the best display in any Smartphone on Planet Earth till today.The way it charges the battery with 65W SuperVooc charger is insane.Let me Tell u About Some Pros first-1.Display Is the Bestest In any Smartphone Ever2.Flawless performance from the best Chipset Inside3.World's Fastest Charging Phone4.Superfast Read n Write Speed through UFS 3.1 storage5. Good Camera not the best needs some Software Upgrades6.Better Haptic Motor as Compared to other flagships7.Best Sound In this Price Range or In Android MarketNow I have To talk about Cons -1. Battery Backup is not upto flagship level but it's not hurt that much because of 65W SuperVooc Charger2.Always got Accidental touches due to It's Curve Display3.Bit Slippery and got Fingerprint on Its back glass4.No Hardcase provided in the Box and the Quality of pre-applied screen protector is bad5.Not a Single Good Quality Screen Protector or Case Found on anywhere till now that's a bit annoying for me .But I highly Recommend to go with this one 😊Oppo Find X2 is real Flagship of 2020\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  True flagship .\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Display is top notch. Video Streaming is an absolute pleasure using this phone. Ultra Vision Engine and Dolby Atmos stands out.Charging from 0 to 100 in around 45 mins.Photos were good. Videos were far better than I expected . Auto Focussing speed and Stability were the highlights.UI is clean . Color Os is definetely getting better.No heating issues as of now. I got a clear 7 hrs ON-screen time with heavy usage On 120 Hz , Auto Fhd-Qhd . It was just a day of use and I'll update my thoughts after spending more time.EDIT -I have attatched camera samples .After 3 weeks of use -1. Display is one of the best.2. Video streaming- I had one of the best experience using Netflix and Youtube.3. Charging and battery - The battery lasts 7 hrs on heavy usage constantly and can be fully charged under 40 minutes . The battery standby is also good.4. Camera is good and it depends on the individuals use , as to what that person demands from the cam. I had a good experience with it. Front camera was really good and gave decent selfies.I did observe a dynamic range difference when shifting from normal to ultrawide sensor.5. No heating issues during heavy usage and charging . But did observe some while recording video . The regions around the rear cam gets heated up during recording. But that was not much of an issue .6. UI was okayish but could definitely improve. I was using Oneplus 5 for 3 years and shift from oxygen to color OS was observable. One hand mode was of great use .7. The curved edges and design are beautiful . The case sent along with the phone was also good. The charger wires could have been of better quality. (There is also an unavailability of other quality cases for the phone.)8. I had been waiting to buy Oneplus 8 pro but due to its unavailability and display issues , I went for this one and I do not regret about it . Its almost identical to what Oneplus has to offer except for the smaller ultrawide camera sensors and an increase in price by 5k . The price would have been perfect at around 55k-60k.Final Verdict -It depends on the persons preference . If you are a person who would want a premium feel smartphone with excellent display, video streming experience , good design, good camera setup and fast charging : Go for this one . It would definitely win your hearts - a quality product from Oppo.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It's wonderful product ,I love it,1. Charging 0 to 100% in just 25 mins,2. Display is awesome,3. Speed and 120hz refresh rate is adding more to the phone,4. Battery life is little concern but over all superb phone.I brought it on first day sale , this phone looks premium , curved display, ceramic back, super grip.Overall it's superb better than one plus 8 pro...\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Read about the products reviews everywhere from youtube to news articles. Initially, little sceptical to invest 65K on oppo. But after product delivered, my overall experience with oppo totally changed.I was aware that oneplus is manufactured by oppo, hence quality & durability never a barrier. Oneplus marketed in online & Oppo in offline that’s the difference, rest everything is same.Coming to the product – OPPO Find X2It impress me from the 1st impression, which is box of product. They make sure customer feel premium from first look itself, have to admit they invest lot in box.Screen: That’s the main USP of product, I used apple, samsung earlier but find x2 is best of best in terms of screen. Be it 120Hz refresh rate or resolution everything is best. It has eye protection & flicker free screen so now worry about web-series.Charging: 65W charging unbelievable, I never have to wait for charging my phone. Just plug in and you phone is ready for single day. After watching Netflix for 2 hours only 5% battery consumed.Processor: I has best qualcomm 865 processor, just don’t think about slow speed. Its history now.5G enabled: Cherry on the cake, what better can expect from any flagship phone. You don’t have to think for next two year to upgrade the phone.Wifi 6: Never thought wifi version make such a difference in network speed, lag free, never found any delay in opening any page.Overall, this is best phone in the premium segment. Don’t think twice, if you really want to purchase phone not invest on Brand, then go for OPPO Find X2.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Phone is awesome. With a great camera, however buying Such an expensive phone and you get bloatware.fast charging is very Amazing that's the best thing about this phonenow things which I did not like about this phone as all the icons if you compare another premium phone like oneplus or Samsung  stock icons looks sharp and define Icons in the notification panel all look Chinese and cheap pure cheap when we talk about hardware that's amazing however software is something which I did not like the colour OS is not for me. Only because of the software i didnt like the phone\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Oppo Find X2 has worst selfie camera Possible. Even worst then mid rangers like Oppo Reno 2 ! The rear camera uses two year Old Sony IMX586 Sensor !!Just second day of purchase and so much disappointed !! Want my refund if that was possible !!\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Pros1.Superb display on par with OnePlus 8 pro, samsung S20 series line2.120hz qhd screen is breathtaking3.Main camera nd selfie cameras are good..4.Charge from 0 to 100 in 30mins5. Gaming, browsing internet, using phone is a breeze thanks to sd865 processor6. Phone ll last 24 hrs from full charge by normal usage7. Phone build quality is superb nd sturdy right there with OnePlus nd samsung flagships8.ColourOS7.1 evolved comparable to oneUI from samsung9. Screen tempered glass is pre-installed...phone back cover given in box also goodCons1.Ultrawide camera is average compared to OnePlus 8 pro2.Type c earphones given in box is mediocre for the 65k price tag3.Inbuilt oppo app market showing ads4.Font nd theme customisation are all pay to use...5.IP68 is missing in a flagship this costly for 20206.Fingerprint sensor not as quick as samsung S20 series\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Find X2 (Ocean, 12GB RAM, 256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Suparb profermance soupar lookAfter 3day experience  feeling real ultimateToo many new experience with this phoneMay be cost is to much but best look and proforms\n\n  \n"}
]