[
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Best phone.... An iPhone is an iPhone... Like no other!\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Too much .. just too much ‘heating ‘Same in hands as iPhone X\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Finally I decided to go with Apple as it now has an LED screen instead of IPS LCD screens that Iphone 8+ and previous versions had.. ( I also used my dads iphoneX for around 2 months and decided to go for this when I was convinced) Though it is expensive, i believe its worth the money.. I feel its much more secure than Android and its not forcing me to have Facebook, Youtube etc that my Previous Samsung phones always did... Just to let y’ll know that I was a big fan of samsung.. I have used Note 1,2,3,4,8 S4, S7 edge etc.. Though its screen was good.. they use to slow down after some time of use.. I purchased an Apple only after positive reviews from my friends and I am loving this so far.. 3 GB RAM in iphone x or 4 GB RAM here in iPhone XS is far better than 6 GB ram in a Samsung.. I also play PUBG and I am also loving the Gaming experience.. Very important, it runs on High graphics mode where as my Note 8 use to work on medium graphics even when I used the mobile on Gaming, High performance or Entertainment mode... So, I am loving my iPhone so far..And the face ID is just awesome...\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I had bought a brand new iPhone XS in April, 2019 for about INR 1,00,000 (1 Lakh). My phone had fallen off my sofa and onto the floor and I had a small crack on the phone. I remember seeing 1 year limited warranty and so I booked an appointment at the nearby service center. When I visited the center, the service person told me that I had to pay a fee of INR 33,000/- to get the screen fixed. Rs. 33,000/- for repairing a display !! When I inquired about Apple Care protection on the device, he mentioned that Apple does not have any warranty against Screen damages in India and it is available in US and other countries.1. Is Apple expecting its users to change the phone which costs almost 1 lakh just becuse there is a crack on the screen?2. One Plus is providing free screen replacement warranty for a year that costs half the price of iPhone.3. Why can't iPhone users in India enjoy Apple Care + benefit similar to other country users for a small premium?4. This strongly discourages Indian consumers to go for an expensive phone if screen damages are not covered. Apple gadgets users are at a disadvantage if expensive costs for maintenance continues.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  As apple fan I love to use new Apple products. And its really wroth iPhoneXS\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Disappointed due the Camera of Xs (In low light/indoor photography face output will be totally artificial). In comparison with my old iPhone6s, I vote for 6s for low light/indoor photography. (I am not talking about selfie camera issue. I identified issue with main camera)Contacted Apple service centre and their response is “that is how iPhone X & iPhone Xs designed”Raised issue to Apple customer care number and shared the sample pics and other required data to analyse. Apple customer care came back to me after a week asking pictures by providing multiple scenarios. I have seen similar post for iPhone Xs MAX with the same issue in apple forum and the final response from Apple is: check lighting while taking pics.I am not sure why very less people has raised this issue in Xs Camera reviews (started digging more and observed in reviews only after facing the issue)Please note that, iPhone can’t be returned to Amazon without the approval from Apple. Apple don’t agree it’s as issue. Totally disappointed.This might be best Camera in some scenarios, but for me it’s a total disappointment.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  As a tech and apple enthusiast : This is one beautiful piece of tech and engineering marvel . From its seem less design to its attention to minute details (thx to the designing team behind it) , it will force you to agree that its insane price tag is justified the moment you hold it . I can never believe myself  of how much my views have changed about this product and Apple from it release to the moment I had it in my hands .Well if you want to know specs and comparisons well you have youtube , there are plenty of reviews there but if you are ready to buy such an expensive piece without selling your kidney then those reviews and comparisons don't matter to you I guess .My review :Camera : trustworthy , reliable , takes very aggressive HDR shots at times but generally neutral with its performance , you will find yourself editing the pictures a lot and I never complained it as I love doing it and when the base material is so detailed and accurate to begin with that you never lose any significant amount of quality after many editing cycles .Battery : Respectable AF ! Never expected this from a sub par capacity battery , while it is not the best , its at a very respectable position for sure  , it surely will surprise you once you use it .Speed : The king of phones in speed period .Design : 10/10Negatives - Face ID doesn't work in landscape , Charges slow .\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Personally i feel the XS is a complete phone. My last Iphone 6 worked flawlessly for 3 yearsI was confused between note 9, xs, one plus 6T and other latest handsets.Finally chose IOS over android as it is more polished than android and the apps in my opinion work better on an IOSDid not go for the Max as i prefer the smaller size.Price is definitely high and i got it in a nice deal from amazon which knocked off 20k on the price tagPlus got free screen replacement cover, no interest EMITips:Wait for a SALE to get maximum savings. This phone is worth it if you are getting it at a good deal. get a cover\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Feeling cheated. Nothing wrong with the product. But i saw an ad on insta mentioning iphone xs max 256gb at 1.09 nd here i have an iphone xs 256gb.I dearly wanted an xs max model and now there are not ready to exchange even if i am ready to buy a new one.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone XS (512GB) - Space Grey", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  While purchasing the item it has been shown that it comes under no EMI cost. But when I received my first credit card statement it shows EMI amount plus interest plus GST cost. Pls clarify.\n\n  \n"}
]