[
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The product is fine and working well. Battery and camera quality is phenomenal and met the expectations.  Unfortunately the Amazon promise on zero cost EMI is misleading. I opted for 6 months EMI considering zero percent interest. But HDFC bank charged me around 12% interest plus GST etc. This is like taking customer for a ride.  I was surprised to receive a msg like that from bank. Just to alert Amazon to rectify this immediately.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Nice phone at this range.. value for money..\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  There is no earphone in this mobile\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Poor camera\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Mobile is a very good battery backup nice camera very good but video picture quality is low\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Very good mobile. Value for money.Everything is perfect. Finger print and face unluck are Very fast with compare to other mobile. UI is very good and smooth with compare to so much hyped mi os. Every features working perfectly. Good camera, wide angle features should have been better. Good front camera n excellent battery backup. No heating issue. Provided cover is of good quality. Better than all mi phone as I was using mi previously.\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I bought this phone  around 2 months ago  as per my requirements its really a  nice phone, for camera i will say good not excellent its average only  its design is really nice specially the back side of phone it looks really awesome.... for battery i will give 5 star awesome battery back up compare to my prevoius phones.....no hanging probem... no internet issues everything is excellent....fingerprint is very nice.... i will recommend this phone to everyone who want a good phone under 13 k. vivo awesome\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Everything is good except Camera, if ur looking for perfect camera then dnt buy this phone, if u are ok and can manage low camera feature then go for it 👌\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Phone is good only is looking ,battery backup is not good like 5000 MAH,camera quality is very poor,I think not should purchase .\n\n  \n"},
{"Brand": "Vivo", "Model": "Vivo Y12 (Aqua Blue, 3GB RAM, 64GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The picture quality of this phone is much below expectations . The picture quality of a13 Megapixel camera phone is like a photo clicked by 2MP camera..Overall phone is good built...BUT DONT GO FOR BUYING IF YOU LOVE PHOTOGRAPHY and even if know a bit of technical stuff i.e Mega pixels\n\n  \n"}
]