[
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  ==== A lengthy & brutally honest review. It's worth the read if you plan on purchasing this device. ====I am a Design Specialist by Profession & also into Mobile Photography, hence I was hooked in using the Pixel 2XL. This phone is a worthy upgrade if you're transitioning from Galaxy S9 / Pixel 1 or 2 series / OnePlus 6, 6T & below / iPhone X or 7 and below.OnePlus 7T Pro is only an incremental upgrade over it's predecessor OnePlus 7 Pro.===== What has been improved over the 7 Pro? ====+ Faster Processor. Snapdragon 855 Plus.+ Adreno 640. Better Gaming Performance.+ Better Haptic Motor. Same as the 7T.+ Fast Charging. Warp 30T Technology.+ Brighter Nits (Upto 1000 compared to 800 of 7 Pro)+ Super Macro Mode, Night reading Modes, Android 10 out of the box, Better Nightscape 2.0. These software updates will be eventually updated for the 7 Pro as well.==== What's in the Box? ====OnePlus 7T Pro Device.User Manual.Transparent Silicon Case.SIM Ejector Tool.Warp 30T Charging Brick.Type C USB Cable.And some cool OnePlus Stickers.==== Display ====Firstly, OnePlus 7T Pro has a stunning display over its predecessors. I'm personally not a fan of notches nor do I click a lot of selfies, so I prefer the OnePlus 7T Pro's Fluid Display. Feels more luxurious over the 7T. It's marginally bigger to hold as well. I would recommend using a case so that the edges don't feel slippery. However, you should also note that in different lighting conditions, 7T Pro has glares at the curves due to the rounder corners which I believe is negligible. 90Hz is smoooooth. You would never want to get back to 60Hz once you're used to this.==== Performance ====Snapdragon 855 Plus is one of the best CPUs out there (at the time of writing this review) and with Adrena 640, it takes gaming and multi-tasking to another league. COD & PUB-G juices out at their best with 60FPS & is indeed smooth than imagined. 855 Plus is at par with the A13 Bionic from Apple. Haven't experienced any drops in frames. RAM Management is splendid & 8GB RAM is recommended unless you want to get the 12 Gig McLaren Edition to save on a few seconds everyday.==== Camera ====I honestly have to admit that it's not the best out there as I was expecting a leap from it's predecessors. It still uses the Sony IMX 586 (48 MP) for it's main sensor and it's Telephoto at 2.2X optical (3X lossless) and is at par with iPhone. But when compared with the GCam Mod, the OnePlus Camera seems to have improved a lot from it's previous versions. The Wide Angle is fairly okayish with some distortions being present at the edges. Nightscape is now available for Wide Angle shots too.==== Video ====If you're into Video Recording, then be a bit disappointed to hear this as it isn't the best while it can still take average videos without much shake utilizing the OIS and EIS at 1080P and just OIS at 4K 60FPS. It still doesn't shoot 4K in wide angle. Apple iPhone 11 takes the lead here. OIS and EIS combined together has a lot of warping and rolling shutter which is a turn off for video producers. It's still not an alternate for a Gimbal. The videos look oversaturated too which can be fixed by shooting on a Third Party app like Filmic Pro.==== Software ====This is one of the biggest features for you to switch to the OnePlus. Stock Android was butter smooth while I missed out on a lot of simple gestures like Longer Screenshots, Silence Button, Customized Navigational elements & much more which lacked on the Stock OS from Google. I would say Oxygen OS should be set as a benchmark for Google to include these incremental features on their upcoming flagships. Oxygen OS has presently the best OS Experience for Android.==== Battery ====Warp T30 is super fast. It helps you charge from 0-100 in lesser time than an episode on Netflix. Although not the fastest charger in the industry, it still gets through a day on heavy usage.==== What could've been improved ====- Minor improvements on Camera.- No ToF sensor- No Wireless Charging.- IP Rating.- Better silicon case should be included in their future upgrades.==== Verdict ====No doubt that the ASUS Fans would recommend the ROG 2. ROG 2 is hands down the best gaming phone with 120 HZ Display but lacks majorly on other aspects like software updates, Telephoto Camera, Splash Proof, Build Quality and security patches which are very essential for business professionals or regular consumers. ASUS is also not known to provide regular updates to it's consumers over the OnePlus which has a closely knit community among the developers and has more Brand Value than ASUS & nevertheless to mention that the OnePlus 7T Pro feels premium out of the box.If you're planning to upgrade from a device almost 2 years old then this would be the best upgrade in case you require a phone with no-notch and curved screen. 7T Pro feels very slippery when compared to the 7T. I wish they made smaller devices. Otherwise I would still recommend the 7T which is the best bang for your buck.If you still wish to own this but cannot afford the extra rupee on incremental updates (Fast Charging, 855 Plus) , my suggestion would be is to go for the OnePlus 7 Pro. It's still one of the best devices out there.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I think I am the first one to write a review for this beauty :)  I ordered this at 11 PM in the night and It was there in my hand in the morning 9 AM.I have used iPhone X, Samsung s9 plus and Samsung s10 plus before coming to One Plus 7T.  My experience so far with this:1. Display: It's amazing. Sharpness, brightness and 90Hz displays makes it one of the most beautiful displays.2. Camera: All of my previous mobiles had great cameras. 7t Pro is nothing less than that. If you are a professional photographer, you might find differences. For a normal user, it's just perfect.3. Battery: I am getting a very good battery backup. When I go to bed, it's 30%. 30T Warp charger is a booom.4. Performance: Blazing and Lightning fast.5. One of the USP of OnePlus mobiles is its Oxygen OS. After using iPhone and Samsungs One UI, I can tell you that it's the best. Lots of gestures, shortcuts and very lightweight.The only Con I think it has is its weight. It's on the heavier side but after using it for few days now, I am getting used to it.Go for it guys !! You won't regret.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Its fastest phone that I have ever experienced. There are no hiccups, none what so ever. Overall smooth experience between switching apps and regular functions.The Display is to die for.Magnificent Macro mode and Night mode  in camera.There is just nothing wrong with it.Overall an overwhelming experience.Call of Duty runs flawlessly ...The phone is so fast it takes some getting used to.Charging speed as advertised.No Complaints.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Hi, When I open my this most awaited phone, I just saw 2 major Draw Back1st. The Camera Quality, Dear One Plus maker if we paid you 54000.00 (53999.00) then why we compromise with today's main features the CAMERA.The zoom quality is very poor, pic are RIP-UP,DURING ZOOM SHOT OR WHEN YOU SEE THE CAPTURED IMAGE WITH ZOOM.NIGHT PHOTOGRAPHY AND SHOT IS ALSO POORIN NIGHT PICTURES YOU SAW LOTS OF DOTS- RIP-UP.IMAGE NOT CAPTURED IN HIS ORIGINAL COLOR.THERE ARE LOTS OF ISSUES WITH CAMERA QUALITY.SO THINK ABOUT YOUR USERS AND GIVE A BEST QUALITY.Hope ONE PLUS Team look and work on it and solve this issue in his next software updates.Dear Amazon team pass this feedback to ONE PLUS TEAM.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Amazing phone with an unbelievably smooth and vivid display.I had been using the OnePlus 5T before and a big fan of OnePlus cameras and OS.But I've always felt the OnePlus display wasn't good enough.This mobile just killed that thought.Highlights:1)Buttery smooth, fast and bright display -The edge display is just wowwww. You just can't stop admiring it.2)Excellent camera - The pictures come out so well in all kinds of lighting and modes.  *Portrait*- The new zoom mode in portrait is just wow.Looks exactly like DSLR clicks.  Macro - I love taking closeup shots of flowers and patterns and with this...you can get as close as 2.5 cms and click amazing shots.  Nightscape - This area is a huge upgrade compared to my OnePlus 5t.You get crisp and clear pictures without any noise.The pictures are now to the mark of Pixel mobiles.  Popup camera - If you are hesitant or doubtful about popup cameras...I am telling you there is nothing to worry...It is Soo smooth and quick that you never will notice it is a hardware controlled camera.Selfies have never been this better.Bright and sharp shots anytime.  Video - Haven't really used much.Will update later3)Dolby speakers - Excellent sound quality with awesome stereo effect.Once again a huge upgrade over the older models.4)90 Hz refresh rate - Yes this one gives you a totally different experience when using your mobile.It is clearly faster and better than the usual 60Hz displays.5)Build and design - Just perfect...It's sleek...stylish and neat. Loved the camera setup in OnePlus 7T but hated the circular bump.And I totally loved the edge display in OnePlus 7 pro.This device is just a perfect combination of the best features in the 7t and the 7pro and NOT an unwanted model like everyone is claiming.6) Batter and charging - The charging is blazing fast and the battery very easily lasts a whole day,even with 90Hz refresh rate.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  One of the best Oneplus phone ever. Superb Amazon 👍🏻 One plus 7T pro is far better then iphone 11.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n   I was really happy to have this phone, switching from apple to android. The phone is really big and has lot of power in it, no problem in playing games, its like silk smooth games, navigation between apps, super fast. All updates were done for software and apps. I am in love with it.... ButAfter 2 days of normal usage and random navigation on the device. The device started rebooting itself, I was shocked but thought maybe just after reboot it will ok. But it rebooted for 3 hours continuously without any stop, till the whole battery got drained. I was not able to perform any action, it made me handicapped for 3 hours, where I cannot do anything... Check the videoFinally, I am returning it after long conversation with Amazon support and the OnePlus team.Buy at your own Risk..!!!\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  i bought one plus 7T pro on  last Tuesday i.e. 22/10/19 and with in one week it is started some software and hardware problem. phone is not working well and heating problem also with the mobile. i call customer care executing they are not treating well. waste of money product. please don't buy it from this seller.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Phone is great. Everything is good.But I have one doubt. I got acko screen protection for 1 year.But Amazon didn't mention about this acko screen protection offer.Do anyone got too?\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 7T Pro (Haze Blue, 8GB RAM, Fluid AMOLED Display, 256GB Storage, 4085mAH Battery)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  No 3.5 headphone jack(Phone is thicker than 3.5 and there's plenty of space). No 3.5/C adapter provided in box. Never settle? No official adapter sold in Amazon either. You have to get registered on their website. Why?!Display seems to have a bit of yellow tint. Although fast, not really seeing the so called magic of 90Hz display. Overhyped. Curved edges make reading a bit weird: Lines go up from the left (curve on the left), then flat in the middle and then go down on the right(curve on the right)- Wish the OS provided a margin on both edges,if needed.\n\n  \n"}
]