[
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Best camera, very good battery life, eat body material, average weight, best performance,  best display.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This is best thing you can get at this price from a reputed brand with Made in India tag. First time I ordered on the first day of online launch and am happy. I'm writing after few days of usage, but this should not be different as my experience with Samsung has been most consistent as compared to other mobile brands I've used earlier.Good:- Android 10! Beautiful looks! Finally I can delete SMS from notification now!!- Display is excellent with Blue light filter.- Performance is good. No heating or lagging. Real Racing worked fine.- 6000 Mah battery is BIG- 128 GB storage is pretty good. 512 GB card supported with dedicated external card slot.- Both dedicated sim slots support LTE- Fast charging and 15W charger top with phone. The phone came with 0% charge. Charged fast.- Mobile speakers sound is good, but I prefer external speakers for better bass in music.- Camera is really good. Macro performance is very good - look at skin in tatoo photo and dust perticles in deskphone photo!! (photos of M31 are from other phone). Both front and rear camera support FHD video 3840x2160. I may not require to carry my DSLR everyehere.- Face unlock / figure-print sensor response is good- Received next day by 11 AM !Not So Good:- Not that thin, but ok.- Doesn't have Samsung Dex- Started to Boot Screen!! Gave me a little shock but selected reboot option and then every thing was smooth. An Android Updated (other than many application updates which is normal in any case) appeared on within days of launch. But update was smooth. No issue at all.- Feels delicate in hand but a Rs.49 cover was good enough. Wrongly ordered black while the set is blue. Just 49 so will reorder the blue one as well :)- Called Samsung Store, but no information with them about availability date. Still no call from them.Feedback- Feels good in hand and in use. It is a powerhouse and you feel it.- Will update after few days of use, but don't have any doubt as of now.Go for it without any doubt.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  3rd class front camera. 32 MP front camera n looks like 2mp front camera. In very disappointed  with this kind of front camera. Need refund.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Lets just begin with the obvious. This phone's quality doesn't meet the claims made.Cons:1. Camera Quality: Picture quality is just awful. Its worse than a 8MP camera. The pixelization is obvious and it is definitely not a 64MP camera. Do not believe the claims Samsung might make. The quad camera is of no use as the macro camera reminds me of the decade when VGA cameras were common.2. Battery: Samsung may claim the battery will last for two days but it didnt last that long - no Netflix, Prime Video, heavy games being used. So that makes two of the biggest features useless.3. Amazon's Policy: In case you don't like the phone, Amazon has made sure you are stuck with it. The switch from 10 day \"return\" policy to 10 day \"replacement\" policy is dowright wrong! Hold onto the shutters physical mobile stores - your days are not over yet. When you do request for replacement, there is an inspection of the phone at buyer's site - which I understand but the fact that replacement will occur almost on the 10th day from my purchase still keeps me at unease.Pros:1. Display: The screen quality is good and has adjustment options for warm light and cold light.2. Performance: Streaming videos and playing heavy games was smooth for the first 4 days but then again Samsung is known for fast deterioration of performance, so I will keep my eyes and ears open.3. Sound: Speaker quality is okay but not upto the mark. In a noisy place you fail to hear the crispness and the boom.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I am using it from 3 days , 6000 mah battery is just for name only, it work for 1-1.25 days only with moderate usage.64mp camera doesn't support zoom, camera doesn't support 60fps video recording.Build quality is not good, plastic back with lots of figure prints in few minutes handling, not look new in few seconds.Face unlock very slow.Heat issue which charging and heavy usageFull charge takes more than 3 hrsWould not recommend to buy , if you are looking  for good camera phonego with other brands like oppo or redmi , giving much better quality\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The phone was wrapped in dust. Although it was seal packed, still many dust were on screen and back side. It shows security concerns and Amazon, Samsung and seller must draw its attention. How dust can be reached in seal packed box? Now I'm lacking trust in Amazon,Samsung and seller. Either my phone was used or its components might have replaced, as in brand new phone,there exists no dusts because they are built in factory, but here shows how they are playing with the customer and their product.Phone is nice, large battery backup of more than 2 days, 6.4 display is big, camera is perfect and 6GB ram is enough for daily usage. All things are good. No heating issue.However my only concern is \"dust\" and how it came there if its brand new.So I could give 5 star,but now 1 is enough.Beware of Amazon,Samsung and seller.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Software is no working. No sounds in media, cant attend calls, every 5 mints phone gone to switched off and even though no retraining option.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Phone camera is not good , samsung says it's 64 mega pixel but its photos like 8 megapixels .photo detailing are not good  . Also processor is not Upton the mark it's some time slow and hang in multi function use . While using keyboard , keyboard hide automatically for 1 second . My mobile variant is 6 GB 128 GB. Don't waste your time and money .\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Camera front is worst, not up to the mark. Waste of money. ,\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31 Prime Edition (Iceberg Blue, 6GB RAM, 128GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Not a Samsung performance. It seems it was launched without proper test n trials. I already had M30 so decided to buy M31 (6GB). But got shocked to see the poor performance n battery life. The 64MP images can't be sent easily to someone on WhatsApp. Camera give errors now n then. Battery life worst then M30 which has 5000mh. Mobile heats on charging.\n\n  \n"}
]