[
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I have been a OnePlus user from few years.And I have upgraded it from OP 6.I must say I have made the right decision.Pros: fast phone, 24 hours + battery backup, wonderful screen, no hanging, no lagging, optimzed oxygen OS.Cons: Camera is still not upto the mark, especially in low light. Sometimes it over expose images. But I think it will be fixed in the future update. So no worries.Final Verdict: Go and grab it. 8GB + 128GB is good enough for moderate users.PS: people who are still waiting for \"pro\" just don't think about the price. There are lot of things which you will be bound to buy if you get pro model. (4000₹) wireless charger, etc. So add that value also to the phone value.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I received the phone yesterday... But there are some issues in functioning. I hope that will be resolved in coming updates as I blindly trust one plus brand.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I bought OnePlus 8(8 GB variant ) in Glacial Green on 29th May 2020 and received it on 2nd June 2020.As a OnePlus product, we are bound to expect Strong performance, fast charging, good battery backup, decent camera quality, and overall smooth user experience. And I can say that One Plus has not lead us down again.The touch is super smooth, face unlock is fast as a blink of an eye, I constantly use google assistant which response pretty well, I am blown away with the camera quality and audio quality that is powered by Dolby Atmos.Apart from the strong base of hardware and software the phone has some pretty cool features that I have been loving for instance Digital Wellbeing, Work-Life Balance mode, Quick reply in landscape ,Zen Mode, customization for each application that helps in optimization and intelligent functioning.The phone connects pretty fast to wifi and Bluetooth devices. Does not lag or heat up. I have used this phone for my online meetings as well, the screen renders images and videos pretty well.All in all this a great deal and I highly recommend buying this phone.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Camera sucks, worst picture, need to see it whether manufacturing defect. Pictures are very hazzy,blurShould apply for replacement\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Awesome experience with ONEPLUS.Buttery smooth 90 hz display 😍Color accuracy and brightness of displayYou will be just in love with display of device.Haptic vibration feedback on ONEPLUS 8 is awesomeDevice is very light weight in hands.Cameras are decent and produce decent pictures in day light and struggle little bit in artificial lighting. yet to be tested in detail.Overall look , feel , battery and everything is great and cameras are decent for day to day usage.Juat go for Glacial Green Color. Its fantastic. I was confused between onyx black and Glacial Green but I think i made right decision.Glacial green is best color OnePlus ever made.If want to buy this device just go for it. You will not be disappointed\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It hangs every 5 hours, I started using it a week after receiving due to covid security reasons. Now return period has been over and i have no clue what to do with this garbage. It gets automatically turned off and troubles while turning on. I want a replacement if possible. I had put my previous money to buy it and now i have lost my trust in oneplus.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n   You'll understand why I rated this phone 2 out of 5 🌟. First of all, I m not new to OP. I had OP6 earlier. I am writing this review after 10 days.Battery backup is not like Op6 (OP6 had better).My OP6 had some issues like disappearance of networks and rebooting again and again. I went to service centre they told me it's motherboard is failed. It ll take me Rs. 18000-20000 to get motherboard replaced. So I had to buy new one. Now after 3 days of use same issue happened in OP8 too, like disappearance of networks n power button wasn't working I had to use power button+ volume up+ volume down altogether to reboot it again which was highly disappointing and annoying too.Not only this when I play game at bottom of the screen I can see some disturbance too which u can c in screenshots and videos I uploaded with the review. There is no 3.5 mm jack if u don't want to switch to wireless headphones as I dn like to use wireless ones. I hv asked for replacement but it's been more than 24 hours I haven't received a single email after appointment with the technician. Yesterday I set it to full brightness to worship outside in sunlight and I received a prompt in phone about my phone's temperature So it has heating issues too. Go through the images n video n ull get to understand that y u shud wait for another version or look for another options. Highly disappointed with its performance. Thank you.Hope u ll find it helpful.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Just got lucky on 29may. (8+128, glacier green)I will give some ratings according to me after 4days of usage.1. Display : 4.5/52. Camera : 3.5/53. OS : 5/54. Charging : 5/55. Battery : 5/5 (1 day easily as i am normal user)6. Case : 3/5I loved the color. Also smoothness of phone. Eye catchy display . Go for it. I ordered 2 more oneplus 8 after mine. (:\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I got it today, paid 40k for this but wide angle was blurry , play store doesn't open, battery drains fast.I've asked for a replacement, if I get it fixed I'll come back and give 5 stars otherwise it's 1 star for me. Guys when you buy check all the features they seem to be shipping a lot of faulty sets.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 8GB RAM+128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Its been one week since i am with Oneplus 8, hope this is right time to write down whats good and whats been missed from my earlier deviceBeen a samsung s8 user for 3 years, its right time to upgrade and my search from beginning of this year end up with Oneplus 8Its been wait for 6gb variant and even a DM to OP team didnt helped in identifying sale date of 6Gb varient, then made my my mind for 8GB, reason i felt i am okay with 6gb is because i am not a person to play game in mobile rather use ipad for sameNow the bests:- Sceptic about downgrade of QHD screen to FHD+, surprised the screen quality is impressive- Size factor, smaller 5.8 to 6.55inches to my longer hands it is perfect enough- Sound, far better than S8- Just to give a try on game tried asphalt 9 it is buttery smooth- Battery - pretty impressive, charges constantly in 1hour time, gives 2 full days with Screen on time around 5-6 hours, in one week just charged 3 times- 90HZ to say it is awesome- Camera looks decent for my usage, have to see when i do prints- No complaints on curved screen may be i am used to it last 3 years, so op8 screen looks better too with curvesCons:- first 2 days had issues with Wifi, it was getting turned off automatically once i dont get phone in hand for some hours,not sure it was adopting to usage, now it looks normal- Glacier green from certain angles looks fadedMissing from Samsung S8:- Now have to worry about getting devices in rains of Bangalore- Samsung pay definitely a best of misses, never carry wallets earlier- So many sensors like heart rate, step counts, Health app etcOverall at current market this device looks good for the money spent, will post future experiences too after some time\n\n  \n"}
]