[
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Damaged product\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Its compact feel better for day today normal usage. Very good mobile for all users who require a handy good looking Mobile which can perform all the task well.. display is good... Most practical phone in this price..\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Nice phone from Samsung in this price. Display is good . Camera is not awsome but average. Battery will last 1 day with normal usage. N it has all necessary features. I got this for 8999 . So good phone under 10 k.As samsung so last for years.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Gifted it for my mother. It is perfect size , perfect placement of power and volume buttons, has dust on phone after opening the box but the box was sealed, same thing happened to me when I bought M31,Pros.* Perfect size* Samsung brand* Good build quality for this price* Android 10* One UI 2Cons.* camera is below average* Average display quality* No earphones in the box* No fingerprint scanner* Takes very long time to charge battery.Will update this review after few weeks.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I have compare a samsung, Panasonic, and MI mobile. Mi is better in terms of bettery (5000mah) but all the other specifications are same in this range. I prefer samsung because of brand value and I don't want to buy Chinese products.This Mobile is good for average use and battery last for 24 hour. No heating problem.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This smartphone is very handy and responsive. The cameras are not as good as other smartphones in this price but it gets the job done. If you want a very hand and easy to use smartphone this is it. The quality is the best in this segment.Pros:1. Small, handy and light weight2. Display is good3. battery capacity is good4. fast and responsive for normal tasks5. Durability \"It has a plastic body and looks premium but extremely light and durable\"cons:1. Not for gaming2. charging takes 3 hours 30 minutes3. cameras are not good compared to other smartphones.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I have been using it for a week.I came back to samsung after using Redmi note and it feels so much better.The touch and feel iss awesome. Fast an smooth operations with anroid 10. Lots of intelligent features at this price like limiting screen time for each app and winddown function in the night etc.. Camera is decent for normal photo. Sound and speakers are good for clear conversations.The only thing which might be a downside for some people'could be compact size of screen especially if you're used to big screens. It might take some time to get accustomed if you are a frequent movie watcher.Overall it's much better than the so called value for money brands like Redmi Oppo Vivo Realme etc which are primarily winning customers by offering more storage battery and big screen but lack performance.A good to buy phone for  9000\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Its not value for money,  just passable,  its very tiny phone, not wider enough,  please see length and widths specification specifically.Very slow chargingNot good cameraIf your are planning for students for class, its worthless.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  After watching so much negative reviews from paid youtubers about this Phone, I dare to buy this one because of my guts feeling, and I'm happy to have this phone. DON'T GET TRAPPED UNDER NUMEROUS FRAGILE FEATURES IN CHEAP PRICE BY OTHER COMPANIES. I ONLY WANT DURABILITY.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M01 (Black, 3GB RAM, 32GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The description said it had fingerprint recognition facility. But it didn't have the faciity. And that was one of the main reasons of deciding to buy it.\n\n  \n"}
]