[
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Never buy!Phone came with sim inserted!Used one!Pack opened state\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Proximity  sensor is not working... Very  much disappointed...\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Firstly, thank you Amazon for the quick delivery.The iPhone 8 if compared with its predecessors (iPhone 6 / 7) is truly a powerhouse when it comes to performance. The A11 Bionic chip has played an absolute  role in maximising the efficiency of the iPhone 8. As for the battery, it’s always better to turn off the mobile data or Wi-Fi on an iPhone when not in use to make the battery last longer than usual.When it comes to make a choice between an iPhone 8 and an iPhone 8 Plus, I’d personally recommend the 8. The screen size is pretty decent, fits in your pocket well & at the same time the iPhone 8 maintains the essence of an iPhone. However, if you’re into larger phones or photography (Dual Camera & the Portrait Mode), the 8 Plus is a great option. :)The all-glass panel makes the iPhone 8 a bit heavier than the iPhone 7 however, it adds to the style making the device look more premium.Again, the true tone display feature too has played a vital role in viewing the screen. Definitely helps in easing the eyes.I’m not really into photography so wouldn’t comment about the camera but the iPhone cameras have always been the eye candy for almost everyone.I’d also like to thank the seller ‘Worldwide_Store’ for his prompt response to my queries. If you’re hesitant about the other sellers, buy it from the ‘Worldwide_Store’.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Nice\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Pathetic experience i spent 52000 rs to purchase this phone. Its been two months and i had to visit twice to the apple store. It doesnt get charged properly. Everytime they update the software and give it back to me and after few days it again doesnt get charged. This is definitely and old or refurbished handset. I feel pathetic that after spending big amount i had to suffer so much. I wil never ever purchase such products from amazon\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This is perhaps the most underrated phone. The specs are great. With iOS 12 update, phone functions smooth. Camera is superb. Although it has a glass back but build quality is pretty rigid. You need a cover for sure since the phone slips. In my opinion, it’s better to spend on iPhone and not worry for next four years than spending on android each year. It’s a known fact that iPhones are more durable than androids. Battery is good, have been using the phone a little over a week, but battery seems promising. With heavy usage of around 6-7 hours in the day I still get 30% remaining by 10 PM.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  No information printed on back side. Usually most of the Iphone have this information printed on back sid.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Except for the brand, there is nothing great about this phone. Mainly there is hardly any difference between iPhone 6s and this phone. Better choose some good android phone with range of 20-40 thousand instead. Thumbs down to this mobile.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I purchased this iPhone 8 space grey 64 gb on December 2017. I got it for 57k. I saw the price just now has gone down to 36k so I thought I would write a review about it for almost 2 years of use. Well I got this phone when iPhone X was just introduced but as it was much expensive then I went along with iPhone 8 and I have not been disappointed with my choice. The phone is working in the best possible way as it has been just bought yesterday. Not a single da has I have got any software issues, lag issues, aware issues.. nothing at all. It has been a smooth experience so far and I am looking forward to use it for another 3 years more. ASince I am interested in street photography the camera works pretty good for me.Though the glass back feels very slippery and it is actually but since I always use a back cover so it wasn't an issue for me.I have not used it for much of gaming so I have never faced any heating issues but I do have used it for prolonged period of time and I have not felt any discomfort.One thing which people kind of neglect in iPhone is the earphones provided with the phone.The earphones are of pretty good quality and hence should not be taken for granted. In fact the microphone is pretty awesome to record your music or your songs. it is very sensitive and can record even a whisper.As I use MacBook Air so the interaction with my laptop has been pretty good. All in all I don't regret buying it. As the prices have gone down quite a lot now so if anyone out there wants to get a premium perfect size bezel phone I would recommend iPhone 8. Let me know if there are any specific questions about it.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 8 (128GB) - Gold", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The worst product which i never expect from Amazon. Can't even find a option for replacement and it redirects to manufacturer tech support no. The phone panel is very much loose and shaking. Really felt bad on such a huge nearly 60000 RS purchase.\n\n  \n"}
]