[
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  vary low camera quality, ram showing 8gb but working as 4gb phone, screen resolution is vary low. also disappointing by Amazon because of when i want to return and apply for refund they giving a childish reason  no refund, no exchange with new one just harassment. so please request u all don't  purchase this model and also don't purchase online phone from amazon.the screen is truly bad Don't waist your money in this price you can buy Poco f1 8 gb 256 and Vivo series\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Camera worst..This is not 48mp, it's 5mpBecause photo clarity worstOtherwise okay\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  don't buy this mobile west of money I'm buy this mobile already\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Super camera and phone performance ultimately super I refer good gameing person's no slow mobile only all time run and battery super . And sound unbelievably Dolby Atmos sound\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Go for it. Undoubtedly the best mobile of 2019 so far.Pros - 1. Camera - A+(Specially selfie camera with AI technology, where you will find features like face slim, nose slim, chin slim, 3D , bigger eyes and others. I bet you will like it, much better than Vivo)  2. Internal memory and Ram - A++  3. Build quality - A+  4. Battery - A+ (holding charge including heavy usage and game play till 2 days easily)  5. Charging - A+.Some says it doesn't support fast charging but it is neither a normal or slow charging. It's not a super fast charging but a good fast charging.  6. Sound - A++ in one word awesome. Sound comes as 3D surround sound type. Previously I used small speakers whenever I used to see movies on Amazon prime even in my iPhone. But now no need of speakers. Superb Dolby digital sound quality.Cons - Only the display quality but it is negligible.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Not worth as per price....Didnt get a feel like we are using a RAM of 8 GB...Camera is also average...And Highly disappointed with the AMAZON as they are bound us with only Replacement policy...Dont buy please\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This phone is very good in looks, decent battery, Good performance,I belive oppo launch this phone for those who photography and selfi I'm totally disappointed with the photo quality of this phone, video quality is just ok and can take videos with not much shake. If you want more crips clear image please go for some other mobiles. I hope get little more quality image after updation.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Excellent, value for money.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Camera full screen not displaying while taking photo, option is very limited like chinese camera,Sound is good, display picture quality is very poor, screen size is small it is not 6.5 inch comparision with other 6.5 inch phone\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO A92020 (Space Purple, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Camera is 48 megapixel but looking as 5 megapixel and 1080 video is not supported nothing like itFrom Now onwards I will never purchase any producs from Amazon because they deal worthless products...\n\n  \n"}
]