[
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Update (15/08/2020):Never give a chance to regret..  Go ahead...👍The Icons looks was not so great ..  And then I set 'Spherlue Icons' from theam and now its looks better with dark mode ...Even though its 6000 Mah I always leaves phone on charging before go to bed ( I like to see my phone 100% every morning 🙂 )..  So I turned off fast charging option.. You can do that.. Its will not affect  batteryMONSTER :1. Battery :- 5/5Two day battery standby for normal easy2.Display:- 4.99/5Super amaload with full hd.. Superb Display3.Design:3/5It has a6000Mah battery,  still looking not bulky. Noglass body,  but who cares after you put a back cover..  In my opinion, don't spend more money for glass body if you uses back covers4. Camera: 3/5Back camera pretty good but front camera's low light output is very low..  many features available such as slow and super slow videos available..5. OS&UI:- 5/5Android 10 with One UI6.Finger print reader and face lock 3/5 Face lock and finger print reader are not so fast7.Processor and performance 3.5/5Exynos 9611 is not meant for PUBG gamers  .. But for me its perfect as I am not a heavy gamer..  No lag ang hang till now..  but processor is outdated..8. Charging :2.5/5. No fast charging.. Provided with a 15W charger and iy takes about 3 Hrs to fully reacharge the phone9. Accessories : 2/5No earphone, No Back cover, No Screenguard..  So order backcover and tempered glass when you placing order as its backbody is plastic amd more prone to scratches..10.Loud speaker 1.5/5Loudspeaker sound level is very low.. (Keep earphones)Verdict: For this price  Its the best choice if you are not a hardcore gamer  ...\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  As a title it is obviously a monsterAnd very very good performance\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Brilliant camera, huge battery life and brilliant display in addition with the premium feeling of SAMSUNG. It's a shame that this phone's launch was delayed due to lockdown.Highly Recommended phone 😊😊\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I am writing my review after using it for 6 days.I have bought sumsung phone after 7 years hoping it could be good phone but samsung again disappointed me a lot.They claim it has 6000mAH battery but drain like 3000mAH and it take almost 2.30hrs to charge from 10% to 90% so its fast charging is not a fast charging. Its just a market gimic to clail it monester like features i.e.battery 6000mAH ,15W fast charge ete but reality is far far away from claims.Others features are as per price range but if you thinking for a battery packed phone with fast charge,then I would sugget plz search for others phone in same range.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Defective product received, it gets 8 to 12 hours in charging and Amazon is not exchanging the product\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Very poor performance. Hangs aloft. Even I don't use any gaming app. In browsing only, this phone lacks. Inspite of having 6 GB RAM. This product serves zero rating. Please don't buy  this. Wastage of money. No refund policy for this device.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I love this one, and this is best in class, no.1 best budget mobile and Samsung mobile brand also global no.1 brand in the world. Great one, my rating is more than 5star, thanks to Samsung n Amazon.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Value for money.I am not a gamer. So can't say about the gaming performance. But for those who are buying it for normal usage, this phone is great. With 6gb ram,128 GB internal storage and Amoled display I am more than satisfied.I have been using Samsung phones from the start. Samsung's Amoled screen is what I am attracted to the most. The feel it gives is simply amazing.But battery dont seem to be a 6000 mah.As far as a non gamer is concerned this phone is the best under this price range.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Very Nice Mobile good all\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M21 (Blue, 4GB RAM, 64GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Samsung galaxy m21 very good phone in this price... I am bought rs 12699.. ❤️😉\n\n  \n"}
]