[
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  EXCELLENT PRODUCT WITH SUPER FAST SPEED!!Review :Camera - 4/5Battery - 4/5Display - 5/5Processor - 5/5Software- 5/5Overall 4.5/5Go for it!\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  After 3 days of use..Battery - 5/5Camera- 4/5RAM performance- 5/5Superb phone- a real flagship killer.. Must buy\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  A well designed phone\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  One of best in this price range.It's beyond my expectations for gaming and mobile photography.I have also added 4 pictures for reference. N 3 pictures are clicked from same angle but with 3 different cameras of this ph.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Shifting Samsung to one plus. ... Awesome experience ...Best phone now available in market ....Speed..4g experience in 5g phone best....Mind blowing ....\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Writing after month of use and experiment with camera. This is Not great compared to previous versions of one Plus, camera quality is very bad and photos looks burry and artificial. Especially low light photos are very bad, if you click a moon it will Look like a sunny sky, light enhancement and intelligent image processing has gone wrong. Otherwise its similar to older version of one plus and waste buying this if you already have a one plus. Infact I had one plus 6 which was much more better than this in terms of camera, I was comparing the images of one plus 6 saved to google which has much lesser resolution, one plus 6 pics looked great and near to reality where are 48 MP one plus 8 images looked blurry and full of senseless light and colour. Regretting have sold one plus 6 in a exchange offer.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Awsome phone....Pros-Performance,chargeing speed,Battery life, oxygen OSCons-poor cam quality\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  They kinda SETTLED with this one.1. You pay 50G for this hyped up device and chances are you will get a pre-applied screen protector with bubbles on it. Spend 50 grands worth to see bubbles on your screen?2. OnePlus 3T had a better camera than this, in my opinion. I'm not going by specs here. It's about how the rendered images look and feel. Some images are washedout as indicated on many online reviews and if you feel like zooming in on your shots, you will regret clicking that picture in the first place. OnePlus messed up by a big margin as compared to the iPhones and the Samsung's.3. They give you a silicon case along with the device which turns yellow within 15 days of normal use. Cheap show, OnePlus!Some pros: fast charging, great display (god I can't stand that iPhone notch that looks like a stupid haircut lol), good design, & fingerprint reader.Oh and their customer service is not as fancy as their marketing team. So careful with that too.OnePlus, Never Again!\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The product is not at all good. It's not value for money either. The build quality is good however the performance is not good. The phone lags and has several bugs. It hangs while switching between apps. The ringer, Bluetooth and wifi has performance issues and turns on off or disconnects automatically. Other than that, the phone automatically restarts. The VoLTE functions badly too. I'm not at all satisfied with the product. I would not recommend this phone to anyone. I'm stuck now. But it's better to go for other devices.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Onyx Black 12GB RAM+256GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  With same configuration variants available with Nord by OnePlus. Why go for OnePlus 8 which is almost more than 20000 costly than Nord.I don't know whats the mindset of OnePlus behind launching of Nord with same configuration as OnePlus 8 and almost at half-price.Hence I will give only single star in value for money. Oneplus 8 Product is good but costly.\n\n  \n"}
]