[
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Not so good phone waste of moneyDisplay-10/10 .best 👍great display super amoledPort-10/10..👍2+1 port which is Indian required..Proccessor-5/10.👎👎.22k price and proccesor p95 r u kidding me... If you want to buy in terms of display camera then don't buy this phone.. Main thing which phone is required processors... After some days you feel lacking some timesCamera-7/10 👎averageFingers print-6/10 👎averageFacelock-8/10👍 goodYou choose poco x2 or wait some time m51 Samsung or redmi k20 pro\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  So, I ended up ordering this for my mother. I think I am going to keep it for myself.So far so good, 1st day of usage-If we say that One Plus and Iphones are 9/10s or 10/10s then Oppo F17 Pro is-Battery Charging Capacity- 8/10Battery Lasting Capacity- 8/10Rear Camera- 8/10Front Camera- 8/10Screen- 9/10Sound- 9/10Comes with a cover, ear phones and a charger which is indeed amazing.The phone is surprisingly good. It has a good camera which has multiple modes to click photos. It's front camera is top notch. I think if you get this phone for less than 20k by exchanging your old phone, it is totally worth it.It is a very light phone btw. Easy on the eyes and easy on the pocket.This is a day 1 review, first impression and a few hours of usage after full battery. It charges real quick btw.Shall update and edit this review in future if anything changes.Oppo has caught up with One Plus phones and with this budget phone, it has moved a step ahead.Buy it without any regrets if you can exchange an old phone and get this within 20,000.Go for it.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  My initial thoughts of the productDesign 5/5 - it is great to see a brand put emphasis on design aspect of phone, it is sleek and light - great to holdCamera 5/5- the dual front camera at this price is good, the best part about both cameras was the color portrait with black and white backgroundCharging and battery 5/5 - charging was really fast and I am satisfied with the 30w charging.Performance 5/5- the display and performance of the phone is also really good.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The phone is sleek and very handy. Having 8gb of RAM is the best thing, the phone is fast, responsive. The only thing that I felt Oppo could have made better was the front camera. It not only feels that images captured are artificial but also have very less details captured. Overall the phone battery life is very good, quad camera produces top quality images. I will give this phone 4.5 rating...\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Good deviceBattery backup is goodFast ChargingLight WeightHas 3.5 MM headphone jack\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I had ordered this phone on the launch day and I received it on 10th September. After 2 days of usage My detailed reviewPros :1) Very Light and very slim2) 30Watt VOOC charge which charges phone in less than an hour3) Display4) Battery Backup ( not a gamer )5) Rear Quad Camera has separate separate lens cover for each lens which makes easy for replacing lens cover later.Cons :1) I think Camera is not up to the mark2) Editing options are very less even though AI is there.3) Charging adapter is too heavy of course it's a 30watt charger4) Finger print sensor response is lowConclusion :I love this phone coz it's really very very light and slim and I am not a gamer and I am not a heavy camera user. So For camera lovers and Gamers this I don't recommend this phone. But others who just love slim phone, just buy this phone. It's really awesome however camera is good but not the best. So think and buy.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It is good phone but not best in this price range as it is not value for money product. It has 4 cameras in rear but 2 cameras are just good for nothing. Oppo just showed to customer that they are giving 4 cameras in rear. Phone back is totally plastic whih may get impacted in case of any fall. Processer can be snapdragon but they are offering mediatek. Now focus on some postive things where design in amazing. Phone has amoled display which makes it perfect in its category. Screen size, ram,memory, battery are great.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Battery parfromens not good but battery is very fast charging\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Excellent working ,good camera features ,ear phones were awsome with real sound tracking technology ,value for money 10/10 ,charging is too good and fast charging.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO F17 Pro (Magic Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Nice camera , nice display, nice battary ❤️❤️❤️\n\n  \n"}
]