[
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I purchased iphone X on 26th Oct'18 and started using from 28th Oct'18. When i received the product, it was already opened which i informed Amazon representative but i was told that it is original product and it will not have issue. Within two days, it started giving me issue with network & WiFi connectivity. I again contacted Amazon through app but i was directed to Apple support. After talking to Apple representative, i only got indefinite answer like it could be software issue and i should wait till it updates but Amazon return/replace policy valid for only 10 days. After purchasing a phone worth up to 90k, i had to do all this and still no support from Amazon.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This is my 3rd iPhone after iPhone 4S and iPhone 6S Plus.Being an utter working middle class guy, I don't switch my iPhones very often (my android phones barely lasted me 9 months though). I do consider them extremely expensive, and I wouldn't go for one, unless I felt it was worth the money I was paying for it.Pros:- I got this phone for INR 69,999/- from Amazon. With exchange offer, it cost me a little over 60K. For the price (and that price only), this makes it worth the buy.- It may not be the latest and greatest, but compared to iPhone XR, this is a much better package overall. Considering the XR is now priced higher than X. XS is only marginally better, and didn't feel it was worth the extra 30K.- Even after a year of being on the market, this phone is an absolute beast in terms of performance, especially after iOS 12.- The Camera is a beauty. You can't compare with DSLRs, but it is right up there with OnePlus and Google phones.- Looks exactly like the XS, and doesn't even have the S badging. So no one will be the wiser.Cons:- The delivery was a bit of a hassle. I had opted for One Day Delivery, at my work address. The agent reached at 7:30 in the morning, when I was obviously not at work. He did say he will come later in the afternoon. However, received the phone a day later.- The phone is extremely slippery. Invest in a good case, front screen protector and a rear glass protector- Such expensive phones should come with 128GB of storage as base, instead of 64GB. If you record 4K videos, it will eat up your storage really quickly.- Videos get heavily cropped when watching in full screen mode. If you have the money, go for XS Max.- The battery isn't the best. Takes over two hours to fully charge from 5% to 100% even with the iPad charger. With moderate usage, you can get 8 hours barely.- With the price of the phone, should have at least come with the fast charger in the box.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Best picture Nd photo clarityBattery and the phone are great\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Thanks to Appario Retail Private Ltd, I got this 256 GB beast during amazon great Indian sale for under 80k. Additionally received cash back of Rs.1000. On delivery, I checked at imei24 and apple site  (checkcoverage) for authenticity and warranty of the product. I was satisfied as the product was 100% genuine.iPhone is buttery smooth and the full screen is an awesome experience. Personally, I love the notch as it gives character to the phone. No matter how much you hate the design it seems this is quite an \"IN\" thing now for almost all phone manufacturers have started copying Apple. So all you detractors out there of Apple and the notch - take a chill pill :)!!Pros:1) A11 Bionic Processor is blazing fast and coupled with 3GB ram you will never have any issues with any of the heavy duty tasks you throw at it2) Screen resolution (Super retina HD) and the contrast ratio makes the viewing experience breathtaking3) Got the A1865 model ( iPhone X A1865 uses the Qualcomm MDM9655 Snapdragon X16 LTE modem while the iPhone X A1901 has the Intel XMM 7480 modem) which is better than the A1901 model as A1865 covers more cellular bands (GSM and CDMA networks and frequencies) and the performance of Qualcomm’s chips has always been better than Intel’s. LTE speeds and cellular receptions in case of weak signals also are a shade better than A1901.Cons:1) All glass body makes this susceptible to breakage. So recommend having a case around it (preferably a transparent one so that the beauty of the original phone can still be enjoyed!)2) I have to say that battery life is average - a shade better than iPhone 8.3) Additional touch id support would have been better as an alternative unlocking optionWill come up with a detailed review soon in a couple of weeks.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Original product, I love this phone. Using last 2 months\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I ordered new iPhone X grey on Amazon sale. Phone looks absolutely fine but battery is very weak though it has fast charging option my phone requires 4-5 hours to get charged completely n also my phone is very slow.. feels like I have got a refurbished phone. Guys plz never go for online when u r purchasing costly phones. I have done a mistake u think before doing.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Have been using iPhone since 5 years now. This one is really a next level up. Was confused between iPhone XR and iPhone X, but after research i find less of cons than pros over iPhone XR. Go for it without any second thought!\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "Apple iPhone X (Space Grey, 3GB RAM, 64GB Storage)\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Poor quality productDidn’t turn on at all after unboxingSHAME and waste of money\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Its been hardly 16 days and the phone stopped working, took it to Apple auth service centre wherein they sent it to Bangalore assuring us a new phone would be provided. After 3 days the same phone was given to us with few parts being replaced however within 5 minutes the ohone showed similar problem for which it was sent to bangalore. Irritated and helpless we had to again send it to bangalore. Now we are waiting to get a new phone instead of a repaired one as we paid such a hefty amount for a great iphone experience. Documents attached related to the problems faced.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone X (256GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Best phone ever , camera is best , i love iPhone , better than any phone in the world\n\n  \n"}
]