[
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Hell man! Im a oneplus fan till i buy this mobile,Camera of this phone is completely worse before i was using oneplus 6 ,op6 camera is much better when compared with op8.....and important point to note that this phone does not even compete with my moms phone samsung a50s which is 15k rs phone.Lastly if you dont trust reviews on this,Kindly reach me out atI will provide you the originals pictures,because i have wasted 40k ...not let you guys to wasteNote: i have seen all reviews in youtube,but all will say it is bit bad .....but it is completely bad.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I changed OnePlus 8, 4 times! Due to something or the other defects (like headache giving screens, line marks at the back of the body, etc) as it's expensive!Phone boxes were puffed, torned, some displays were dull if noticed closely, more warm and yellowish. No control by OnePlus on this. People go nuts like \"wow what a display\" not realizing that they are being given inferior quality displays of Samsung.I hope I really hope people strive for perfection to really understand and get what they are paying for by controlling their excitements a bit and forward stronger feedbacks, as I believe I was listened and Amazon India did helped me too.My 5th device came altogether from a different location, excellent box, phone built and display feels more broader even with same dimensions, no two parallel lines design or defect at the back, it's clean and curvy like OnePlus 8 8gb variant (mine is the 6gb one). Screen display is still more warm which I didn't want but colors are very punchy and clearly shows the display is far better than previous returned devices.1st OnePlus 8 8gb - Had a very long permanent line mark at the back of the body if looked closely.2nd OnePlus 8 8gb - Display's blue light filter had issues I'm sure as it gave me headache in seconds, eye strain as well.3rd OnePlus 8 6gb - 2 parallel lines on edges of the back body if the device was tilted a little, was like a dent kind of design or defect (I believe though this one had the best display even than the 5th one that I'm keeping and more smoother 90 HZ).4th OnePlus 8 6gb - 2 parallel lines were again there so I thought it's normal and was okay with it, but display was yellowish and dull, playing pubg with graphics optimization made the game look more ugly in extreme hd settings (hdr sucks). Looking at Images on articles, etc were looking just good.5th OnePlus 8 6gb variant - As told above there are no 2 parallel lines, punchy colors, not dull and very good display, however still yellowish in large part of the screen and whitish around above and right & left edges of the screen in vivid mode (I did noticed in some displays it was not this warm). I also noticed vivid mode was nicer and whiter in previous devices than this one whether they were dull or not.I also know screen being yellowish a bit makes video viewing an amazing experience to make it more natural for skin color, etc. But should be less and corrected with all the flaws mentioned. However, I'm tierd and somewhat satisfied but will want OnePlus to correct if possible with software update without compromising any quality of the display.It's said that Apple never compromises on quality, they even delay their production if they find any imperfections (I don't like iOS or use Apple though).  OnePlus should do like this.Not happy at all with this kind of support. I noticed paying more (when I got the 8gb one) was really like getting better qalutiy made device (the first one, if the issue mentioned wasn't there). This shouldn't be the case as this leads to disappointment and all variants should be given the same attention/perfection with just internal hardware changes.OnePlus 8 will be my first and last device for a short period of time. Will look for a brand who cares. 3 out of 5.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Great phone!Gaming performance is so great, device don't get heat up at all even at high settings!I played PUBG Mobile and details it provides were so exciting and make it feel real. Shadows of tree,stones, mud, etc. If you have small hands don't buy it for gaming, don't feel comfortable with small hands.Camera is good, can't say it is awesome!Battery life is great too, charge too fast!UI is as expected stock android, some pre-installed third party apps were also installed, you can uninstall all of them except Netflix.The back cover they provide is loose and cheap. Have to buy a new better one!Over all a great phone!Cheers! :)\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  On the first glance you will feel the premium quality of the Oneplus 8.I have mentioned few good and bad points for quick understanding for every buyer -Good -Very good build qualityVivid displayExcellent performance and softwareSolid battery lifeDecent camera performanceChic designConsistent performanceOxygen OS is blissClass-leading displayBad-No IP rating or wireless chargingLow-light video could be betterBasic cameras setup\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I have bought one plus 8 just 3 days back and now i am facing multiple issues like battery backup i am getting for just 3-4 hours of screen on time also facing issues with mobile hotspot as when i am connecting it with my laptop its getting reconnecting again and again however when i am conneting another device hotspot with the same network its working also its getting heat every time often i use lite application like facebook whtsapp no have apps or games are there i have tried to contact one plus support on call, whtsapp and chat but there is no response from there side\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Camera quality is worst than OnePlus 6T\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Badly Heating Issue\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Great phone, Amazon delivers it within 10 hours of ordering really happy there,Pros: Beast performanceGreat battery LifeBrilliant ScreenFluid 90hzAnd blazing fast oxygen os5gCons:Camera: have a 2megapixel camera for the sake of having 3 camera on the backRest of the camera are only averageHopefully upadates can fix that and given one plus history I think they will!Curved screen cause accidental touches and most covers can't cover phone fully in the front due to display Hence its prone to break more than regular flat screen phone like 7tHave a little bit of weight due to larger batteryPrincing is highly agressive but could have provided wireless charging and headphone jackIn the same price!Overall good phone if you want a future proof phone but this eyes closedBut if you are on a budget 7t can mostly get you there with better camera and almost as fast snapdragon 855plusChoose wisely\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Obviously, you might have done extensive research, watched many review videos before coming here to make your purchase decision. There is only one way you will be happy with this purchase and that is, if you are looking for a slim, elegant, powerful, light weight device offering a premium in-hand feel. Day to day, if this is what is most important to you, then this is the device to get.Camera is going to serve you well on many occasions (when the lighting is good). People might have told you that the camera system is mediocre. That is not entirely true. There have been few software updates and I can confidently say that yes, the camera is neither great nor is it bad. It delivers decent pictures (when the lighting is good) and if you are not a absolute camera geek, then this will meet and succeed all of your expectations. Incase you are a camera geek, then get the 8Pro and dont think about saving money.Conclusion: Feels expensive and has a nice balance in the hand (Its very light and is a joy to use). The glacial green in matte finish is makes the front of the device look expensive (with the dark edge-to-edge AMOLED panel). It performs like it should. It has an QC 865 after all! It will easily get you through more than a day with a full charge. Its a very low risk decision. Cant go wrong - Just buy the damn thing!\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 5G (Glacial Green 6GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  With 3.5 mm jack adapter phone not giving any sound I tested many earphones but it does not work shame on you Oneplus\n\n  \n"}
]