[
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  i received defective iphone 7 32GB silver colour during \"Great Indian Festival Sale 2018\".Amazon delivered the product in a Day.But Product seems to be non functional. as Rear camera get Freeze due to faulty camera sensor. Just to save the time & money, i bought it from Amazon online E-store. Now Amazon representative, asked me to visit Apple Service store. So far i have wasted my precious time & my mind . The phone was sold by \"Sold by Appario Retail Private Ltd \" .I'm really fed up till now. expecting Amazon to do quick action against it.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Redmi phones cameras are great, of course iPhone is better but is the 6 more Redmi phones that I can get for 1 iPhone justifiable for such a difference in price? Well, absolutely yes.iPhone camera is not just better, it is so much better than comparing them are like comparing a Alto with BMW, yes both have 4 wheels, both have AC, both can run at 100 kmph, but you know the difference.The high price of iPhone is so justified by the sheer brilliance of camera it has. Sure it is just 12 MP, but the clarity, my o my!Sure the battery is just about 2600 compared to 3500 of a Redmi, but it lasts longer than a Redmi.I know I am comparing a low budget phone to a premium one, but there are so many people (I was one of them) who were not able to see the reason behind the steep price of iPhone.I have been using a MacBook for 10 years and since my work depends on it, I need it, but a phone? Why? It is not a necessity like the laptop, it is just for calling and taking pics occasionally, and I have my SLR for photography.But I was so wrong, an iPhone is an iPhone. Once you use it, there is no turning back.My last iPhone was a 4S and then since I love buying phones every 6 months, I shifted to Android (Redmi, Samsung, Honor) to satiate my hunger for new phones. All these phones are superb, no doubt, but once you use the iPhone 7, you know that the difference between these phones and iPhone 6s has got much bigger because of the camera.And features like Airdrop (100 pics transferred from the phone to Macbook within 4-5 seconds) are so good if you are using both iPhone and Macbook.Bottom line, iPhone 7 has jumped a big leap from the 6s and the 8 is almost similar. The X is double the price of a 7, so probably all things taken in account, the iPhone 7 is the best value for money among all phones in India\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Thanks for Amazon service. phone is very nice and cool also is the display was very very cool the sound clarity is excellent and phone is very slim. And the processor is very fast Nice performance in gaming. Compare to other phones this is superb.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  My phone is not working since it has been arrived. Complain done atlest 10 times with the customer care but no positive response. I think i am wasted mine 38k. Amazon is a brand but still no response even they are constinusly saying that we cant do anything in this situation. VERY DISSAPOINETD THIS TIME.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  If you are an apple fan !! This is a true beauty to go for !!\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  First of all one would want to know is the product genuine and not refurbished coz during Amazon Big Sale I got it for 35k.Before unboxing the I checked up at Apple website and Online check with serial no , EMEI no and other detailsAnd it was 100% genuine and new Handset.Phone is working greatDelivery was also quick in 03 days ..\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Very good specs which can handle updates for next 4 yrs .Good phone for people who don't use power hungry apps for long durations ,camera definitely upto the mark\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This iPhone7 is in hearing problems. What Can I do\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Exactly after one year 1 week the ear piece ddnt work. when i went to the store they asked me 35k for replacement. useless phones. for the premium price tag of 55-60K the phones dont even work for 1 year. I had 5s, 6 Plus and this 7. All had same type of problems and the phone went into trouble exactly after warranty.Useless.These big companies take india and indians for a ride.I would never buy any apple products for sure.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 7 (32GB) - Rose Gold", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Coming from oneplus 3, this phone has been a great upgrade. Always wanted to know why the iOS is so popular. Well it is because it never disappoints. I am writing this review one year after purchasing it and it works like a charm. Still. I don’t feel the need to upgrade to some other device (iphone 8, x or xs) because it works flawlessly without any lag or delay whatsoever. The camera is great.The only problem is the battery life which isn’t enough for a complete day.\n\n  \n"}
]