[
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  May be my first negative review about the product & Amazon both. I was much elated to receive the iPhone 11 so fast, next day of dispatch i.e. 28/09/19, but the thing I got started heating up every now and then. Contacted Applecare, just to be consoled that it's quite normal. As it continued, tried to return the product by speaking to Amazon customer support but in vain. Some body called me back to convey that only Apple will decide which one to take back. Why is then Amazon took up the sacred duty of selling such an item which they can't exchange/ have no control ? The product developed new issues like proximity sensor malfunction and last but most importantly loosing mobile network every other minute(even had two software updates). It was handed over to the Apple ASP as the return window closed on 10/10/19 (what use it was for??) and diagnosed as having issues and has further been sent to Apple repair facility at Bengaluru. So I'm here w/out my first iPhone after using it(suffering for??) just a little over 2 weeks and the CREDIT GOES TO AMAZON !! Bravo, keep it up Amazon.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Please do not buy expensive product like iphone from Amazon, i had very bad exp, the charger cord was missing and had sound quality issues. Amazon initial told charger doesn't come in box and when i challenged it they asked reimburse the cord amount, but i requested a replacement, after some days they called me and informed that they dont take responsibility of missing items, and 10 day replacement policy they dont follow, you can read the email conversation attached  here where i mentioned every thing, i have the call recordings as well. At last they denied the phone replacement and even to provide the missing cord. For any damage or quality issues they said amazon is not responsible.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Awesome Phone. Nice upgrade from iPhone 6s to iPhone 11. Love this beautiful phone.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The iPhone design is good and the camera quality is awesome. You can also take pictures in wide angles and the image quality is awesome.Phone got delivered at 9am on 28th September (I pre-order it on 27th September at 3am in the morning), I got my phone before the delivery date with nice and secured packaging.The overall look of the phone is premium and face unlocking is fast. I grabbed this phone with HDFC 6K Instant Discount Offer at Just 64K (128 GB Variant).Cons:1. The phone is great but if you use \"in the box\" accessories like \"EarPods with Lighting Connector\", then you might feel a little pain in your ears.2. The phone comes with 5W charger which charge your phone slowly. I recommend you to prefer using 18W charger.Well, I've never tried the iPhone before and I'm using this for the first time (Yes, I'm already using other apple products like MacBook Air & Pro).But the product is great and I'm just lovin it.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  My Phone is Producing Too Much Heat Even Didn’t Put Sim , Never used more than Half an hour And It’s producing too much heat.. Totally Disappointed With Amazon. Now they are saying To Go Icare services( After Calling to customer care several times) Amazon can’t do anything For this . Worst Experience with Amazon. No one would like to repair new phone 😢 Better Go for shop To buy apple products .\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Bought the mobile from appario retail ltd. Mobile is heating up within seconds and also camera modes aren’t working properly. Particularly in portrait mode, the stage light and mono options aren’t working properly.  i raised the same to apple customer care they confirmed that its not software issue. But the amazon customer care told me that they need a job card and report from apple service center. The nearest service center is located at 210km from my place, imagine the amount of strain and how much its going to cost. Before you buy anything from this seller just google it and u can find numerous complaints on this seller. What ever they sell u will find defective products only. There is a thread on this sellers dubious deals in quora. Please be safe and don’t regret after.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Defective product,got heat up within 5 minutes of starting. Need to return  fastVery very bad experience\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The product i got was defective . The face id is not working and the back camera is also not working. There is a lot of hassle to get it exchanged. The apple service centre is also not of much help as the product is from amazon. Please buy phones from apple store to get the right product .\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  In my opinion, don’t  think much about the phone , just get it . I am attaching night-mode on and off pictures. Check the differencePros-1. Best Camera2. Best Security3. Long day Battery Life4. Touch ID improved5. Its an iPhone after all . 😍6. Best Night-mode support7. Best Processors A13 Bionic ChipCons-1. Display could have been OLED in this price but if doesn’t matter . This retina lcd is really awesome.2. Slightly bulky and weighty - if u r shifting from iPhone 7 or 83. Thick bezelsGuys , I am both Samsung as well as iPhone fan. But this price range I would suggest you to order iPhone 11. Its really a great deal.And if u r a long time iPhone user . Then this will be really great for you.Got for it Guys !!!\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 (64GB) - Black", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Just after i switched it on, it started producing so much heating even i cant hold it by hand. Later i tried YouTube, game, normal browsing and it has the same excessive heating issue. Seems defective piece. I need refund asap. I have not paid 70k for a defective phone. I am feeling like got scammed.\n\n  \n"}
]