[
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Honest review for a Honest Samsung phone. I am writing this review after using M31s for more than half month. And my verdict based on truly improved Samsung M series with my experience & tested after usage only.BUILD QUALITY. Superior, as it matches any S series flagship premium in classy look, strong built for this budget amount. My hand is small but still I found 6.5 inches display is good to handle as it is well managed for one hand use also.DISPLAY & FINGERPRINT.With Samsung SuperAmoled display you can truly trust the amazing view angle. Now in M31s feature of Widevine L Certification you can enjoy all those global Dolby theatre experience. I found it reliable for my 1920p to 4k level of movie watching without any distraction due to Infinite O display which gives Full Screen Ratio. Fingerprint on side is much faster than I expected. It doesn't takes a second also to open. Even FaceUnlock is faster.BATTERY.Main benefit of this midrange M series is it's maasive 6000mAh battery which gave me enough juice for nearly 3 days continuously. Tested.CAMERA.This time M series did a honest job by giving us a INTELLI camera of 64 mwgapixel with Single Take feature. Samsung gives what it advertises. Which made me to stick to Samsung brand. My usage of Camera is high & I found no complaints at all in focusing a shoot. Good color saturated. Well bright night shots. Macro shots r OSM. The depth & clarity of 64 megapixel is more developed in this M31s model. So no complaints.PROCESSOR.After using for more than half month I must say, Exynos 9611 works wonderful liquid speed when it is combined with LPDDR4X RAM technology. I have not faced any lag in PUBG or ASPHALT-9 hight end games, in medium setting which is good for battery saving. So 2.3Ghz speed accomplished. No complaints for the budget spent.SOUND QUALITY.After using for hours I found the Speaker this time Samsung made is much improved with Bass Stereo which was missing earlier. The in-ear delivers your ear the pure Dolby Atmos with clear precision and crystal clear bass effect.Bang for the bucks go for it. Thanks Amazon for Safe delivery.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Ordered on Prime day, 6th August 12 AM. Received the phone on 8th August.All aspects of the phone is on par or above the next segment.Display is gorgeous.Lookwise it doesn't feel like an M series phone.FP sensor works well although it can store only 3 fingerprints.Camera is overall good. Can't say it's a camera centric phone obviously. However it has some good outputs6000mah battery with 25W fast charging is awesome. (you get reverse charging as well).The only con i felt till now is the exclusion of a phone cover in the box. This might sound silly but I'm one of those guy's who use phone with a cover only to be on the safer side. Just because there is no cover I'm unable to use the phone as my daily driver right now.Come on Samsung. How much will a tpu cover cost for you?? 50Rs??M31s is actually A51 without on screen fp. It has better specs than A51 which retails around 8-9k than M31s which makes this phone one of a kind.The dimensions are also the same as A51. So you can use the same tempered glass but cant use A51 back cover for M31s since it should have the cutout for side mounted fp scanner.Overall a great phone. Value for money I should say. If you are not a heavy gamer this is the best choice around.Will update the review after using the phone for 2 weeks.Till then book your phone and wait for the delivery as it is back-ordered at this moment.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n   This is to share my horrible experience with Amazon and Samsung. The phone arrived dead and I have to make multiple calls, emails to team to get it replaced. After technician report confirming that phone is dead they now asking me to go for a refund as product is no longer in stock.\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Strongly recommend No..why samsung make lot advertise on m31s.really don't know wt makes new compared to other M series. 'Single take' shot option really useless.People who r looking for camera please don't buy m31s.All the modes camers pictures are 95%blur mode.perfomance of mobile is not up to expectations.When turns into selife mode really shocked IS IT HD photo or Asian paints colored WALL.REALLY SHOCKED.THIS TIME SAMSUNG DISAPPOINTED.Videos display is also not so effective. Starting of series most of them said not  a gaming mobile.really its not gaming mobile.No samsung pay Nfc,No backcase,l.Rather than spending 20k on m31s supposed to switch another model.Name it as blur mobile.THANKS\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  purchased the phone on very first day, delivered by amazon on the next day - excellent serviceabout phoneused it for 2 days and then screen blacked out and phone not workingtried many things as suggested by amazon tech team but its still not workingreplacement order placed but it shows 20 days to deliver next onenever expected this quality from samsung\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Initial impression after using for one day.1. The display is Gorgeous. Feels like a high end device2. Specs say 6000 MaH battery. Power management is not up to the mark. Without using any power intensive app battery drain is quite pronounced and noticeable.  Hopefully Samsung will release a patch to fix this3.Camera: Impressive.  Good lighting conditions result in beautiful and detailed shots. Struggles a bit during the low light conditions. Overall quite ok for the price.4. Processor: Not the fastest out there  but does the job. Nothing to complain about5. Fingerprint scanner is decent.6. No back case in the box. Will take time to get new case delivered.  Case is necessary as the back panel is quite slippery7. I believe the cost should have around 17K instead of 19.5k...! But if you want a non Chinese phone then this is a good option to consider\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I am using this for last 2-3 days now.This is my review after actually using this pgone in all aspects.Pros -1. Canera - Excellent camera - Good low light photography.  64 Megapixel does uts wor. Inteli Cam is just awesome.2. Display is just Superfine even in direct sunlight it works Excellent.Touch is just Excellent.3. Phone looks really cool in hands.4. Smart pop up feature is also good to have.5. UI is good.6. Speaker sound is good.7. No issues in calls - No call drips using Airtel sim.Overall its very nice experience using this phone.I researched alot before burying this phone and i am happy that i made this choice.Cons -1. Battery doesn't look like 6000 MAH it typically gives 1.5 days backup with single charge which other phone alao gives with relatively less Mah Battery.I was hoping to get little more backup2. Processor  - Could have been better3  No back cover for phone as it is hard to find in a market\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  An excellent device would not be an enough word to describe this phone.Got it through prime and Amazon delivered it before time once again delighted with wonderful service by Amazon and the device is a masterpiece.Loaded with awesome features like 1 click camera, 6000mah battery, reverse charging, bigger and butter smooth super amoled display.Samsung has started to capture the Indian market and that ultimately allow us as customers to get rid of data stealer and spy Chinese phones.You can definitely go for this phone blindly\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Don't buy anyone worst product, Waste of money rs 18000. This product too much heating, display quality very low and touch screen not working, Camara is very worst like 2mp Camara, also don't trust Amazon. I have ordered credit card payment. they cancelled orders and not refunded. I have raised complaint against Amazon but no use. don't purchase in Amazon. Samsung m31s hanging even I am not installed single game\n\n  \n"},
{"Brand": "Samsung", "Model": "Samsung Galaxy M31s (Mirage Blue, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Hi all,From Samsung M31s.Bought it on Amazon Prime day sale. Placed the order by 00:04 of 6th August (Day-1 of the sale) and got it very next day Noon 2pm itself. Kudos Amazon India.Grabbed it for 15,999 with a 2k coupon code and HDFC's 10% discount.But, ordered a Matte Back cover and Matte Temper glass (As it didn't come with the box and also wasn't available near me in Chennai). Delivery date is 18th to 25th Aug which is pathetic. I have to take care my SaM31s like a baby.Small review as per my knowledge -On-hand, its so good. (Earlier was using OnePlus 6) Size wise bit bigger that 1+6 (6.5\")Comparing to Nord, we have Memory card slot - no dependency.While updating the phone on first start, i felt bit heat. But later, it was fine.Charged a 100% and had an extensive usage (not a gamer). Battery lasts more than 36hrs (with Bluetooth earphone at times).Charging happened in 70-75 mins with intermediate usage in between.Earphone Jack available comparing to Nord, better than Bluetooth earphone which consumes charge and needs charge for earphones too.Settings - an ocean of settings, wonderful touch sensor and additional features for lock facilities.But, doesn't have indicator on the front face (which shows if notifications are received)No option to find app usage statistics.Audio - Its so good with clear audio in all needs.Photo - Video : Excellent quality of photos and Videos even in a 3x Zoom. Front camera is bit down.Macro Mode is giving a great pic of Close shots.Has Slowmo, Super slowmo, Hyperlapse, Panaroma.AR zone is pure magical. Different features for Front cam and Back cam.Reverse charging facility is amazing. But the box doesn't have USB - charge cable.Overall - M31s is a price worthy with sooo many options.EDIT : Corning Gorilla Glass 3 is fine,just on 10th day of my purchase, my phone fallen down with less than 1m height (slipped from hand) and display borken 💔Handle with care.\n\n  \n"}
]