[
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The triple cameras on the iPhone 11 Pro Max now give Apple the best camera phone, thanks to its great Night mode and improved Smart HDR,a huge improvement in battery life Up to 20 hours video playback; up to 12 hours video streaming ... Apple's slow-motion selfies are fun at 120 fps.Apple has given the Pro moniker to the iPhones for the first time. Everything is improved and everything feels better.It comes with a new Lightning to USB Cable with 5W USB Power Adapter.With Display of 6.5-inch Super Retina XDR display with HDR,True Tone, Splash, Water, and Dust Resistant, Water-resistant to a depth of 4 meters for up to 30 minutes (IP68)), Triple 12MP cameras (Ultra Wide, Wide, Telephoto) with Portrait mode, Night mode, Auto Adjustments, next-generation Smart HDR and 4K video up to 60 fps with extended dynamic range.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I pre ordered the item on sept 21 and received ok 2 Oct . It was in iOS 13 . It is buttery smooth and nice and there was an update of ios13.1.2 available. But after updating I stuck in Apple logo. I could not create a return in Amazon as it's asked me to contact Apple. I wonder why is that.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Decent packaging and shipping 👍 Upgraded from an iPhone X and I reckon its definitely worth it 😊 Size matters, no pun intended, and you can instantly feel the difference b/w a 5.7 inch screen and a 6.5 inch 🤓 If you have an iPhone X or earlier model, you should definitely consider upgrading. For iPhone XS Max, you are better off waiting for next year model as its touted to undergo some radical changes (5G, USB-C, Touch ID comeback and notch less design perhaps). No 5G in this model but doesn't make a difference, at least in India, as even the 5G spectrum has not been auctioned yet 😝  WiFi performance is better than iPhone X as this model supports 11ax protocol 🤗 And by the way, if you are stuck for choice b/w Gold and Midnight Green, go for Gold and thank me later ✨\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  i LOST MY KIDNEYS.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n   11 Pro Max 256 GB phone hanged last 12 hours continues\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I will rate one start for this product. My experience of using this phone for one week is sub-par, multiple times in this one week this phone hanged. Many time even home screen was hanged( i have installed only five additional apps quora, amazon, facebook, whatsapp and google maps). Please refrain from purchasing this phone. It is waste of money.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I was using iPhone XS Max, but now after having iPhone 11 Pro Max - I can say it is fabulous and outstanding. Perfect as always, performance is too good.Night mode is better than any available camera, Pixel 4 XL, Mate 30 Pro and Note 10+.This device is unbeatable (until next iPhone).\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  In love with it\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I Love the iPhone Pro Max, purchased from Amazon IN, on Oct 14th 2019. This space grey 64 GB base model was delivered to me on Oct 19th. Here are my objective views about this phone:What I didnt like:1. Obviously the price tag. At Rs. 1,09099.00 is a major deterrent when it comes to decide on buying a phone.2. The base model should certainly begin at 128 GB or higher. 64 GB is not gonna be enough when storing 4K videos.3. Optical zoom in camera is still 2X, where as Android phones already have 5X zooms.Now about what I love in this phone:1. The Camera. That is the main reason I upgraded from iPhone X to 11 Pro Max. The Ultrawide lens, the improved telephoto lens, night mode, improved portrait options, all give exceptional results. The snaps taken by this phone could compete with some of the most professional DSLRs. 4K video recording support on front camera is an additional bonus.2. Battery Life. All the reviews have been right about this. I used to charge my iPhone X every night, whereas for the same amount of usage, now I have to charge the 11 Prod max once in 2 nights.3. Display. I was already a big fan of the 5.8' OLED display on the iPhone X. At 6.5' , 11 Pro Max offers the best OLED display I have come across smartphones.4. Face ID is faster. The apps and the interface work smoothly as ever.5. iOS 13, though still needs fixes, is a wonderful operating system. Dark mode is a welcome change.Overall, this is a beast. Admire Apple for catching up with its android counterparts on several of the features. The 11 Pro Max is definitely a phone for amateur & professional photographers.\n\n  \n"},
{"Brand": "Apple", "Model": "Apple iPhone 11 Pro Max (64GB) - Space Grey", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Switch on and off button is not working, looks like given used phone in new box\n\n  \n"}
]