[
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Pros:1) Clean and bloatfree OxygenOS, which runs as smooth as they come.2) AMOLED screen and 90Hz refresh rate really go along to make the display above average.3) Battery life is decent and will last a day on normal usage.4) Sound quality is good and modestly loud. (Drawback in Cons)5) The design actually fits the hand well as it is shorter than usual on breadth, and a bit more on length, all the more better viewing experience.6) Gaming performance is average. (Similar phones in this range have better gaming performances)7) The phone looks and feels premium while using.8) The alert slider makes it very convenient to switch between different modes.9) Face Unlock is as fast as other OnePlus phones. (Very very fast)Cons:1) The camera is not as good as it was expected. The macro lens is pretty useless, and the main camera lacks depth and the colors aren't as vibrant as OnePlus 8. A bit too much of beautification was there in selfie shots. 4K video recording @ 60fps is absent but 1080@60fps performance is quite good. (The camera is better than most phones out there but it isn't what we were promised)2) No headphone jack.3) The mono speaker is on the bottom right of the phone, which tends to get covered by your hand while using. Also, being on just one side of the phone, the audio isn't as well delivered as it is on a stereo speaker.4) No expandable memory slot.5) The plastic frame (doesn't look like plastic but it is) is a worrying thing and makes the phone *comparatively* less durable.6) Fingerprint scanner being under the screen isn't as quick as a traditional fingerprint scanner on the back.Recommendation: If you're looking for a phone which delivers high performance and smooth interface for your daily use, go for it.But if your prime purpose is gaming, there are better options available.Also, if you're expecting flagship camera performance, you might want to consider other phones. (Pixel 4a is about to release, that's far better probably)Update: Pixel 4a camera is surely much better that Nord's camera.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "3.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It's not very often I leave a critical review for any product. But i was so excited when my new OnePlus Nord got delivered to me earlier today, ahead of time. While i am still exploring the phone, the one aspect that is a complete let down is the camera. The pics I clicked were grainy and so not cool. I must say oneplus, you guys really turned me off this time, like honestly. Most phones these days look and feel alike with the camera being one aspect that sets the winners apart from ordinary phones...i dont know what you guys did here. Not expected team OnePlus...this is just not you. My Poco F1 that i purchased 2 years back returned 10 times better pics. Since i cant return this item, I'm going to live with this for a while before i upgrade. I am sorry for the negative review.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Battery usage update: Drains faster than other one plus models...so for the ones travelling frequently, this might not be an ideal phone...fast charging is a relief for ones who have access to charging point....Morning to Night usage possible with moderate to slightly heavy usage....Bottomline: A good entry phone for those who have never experienced One Plus and the ones with budget constraints... For others, one plus 8T(lighter than pro model at 180 gms) would be ideal which should bring 120Hz refresh rate and maybe wireless charging too..And for those who can afford and dont mind a heavy phone(200+ gms), One plus 8 pro or 8T Pro would be ideal ones.(As per Amazon reviews some users are reporting display issues with 8 pro, so 8T Pro hopefully will be a better model.) I still use 7T pro which provides the best of One Plus experience...INITIAL IMPRESSIONS:No tint issue which has been widely reported.Smooth given 12gb RAM and 90Hz refresh rate.Lighter than Pro Model but still feels sturdy.Camera quality on par with top model one plus devices in case of outdoor pictures, Indoor/low light pictures are not that good...Not a fan of punch hole cameras..would have preferred full screen with pop up instead.Battery usage - needs to be tested but seems to be ok....\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Yea..pre-ordered on 28 July, got it on 4 August. Package was nice without any damage. So here is my first impression:• Display is so nice and 90 hz refresh rate feels so nice and smooth.•Camera is okay, but not upto the mark..macro lens and depth sensor at the back is just crap. Wide angle is okay, but images are too smooth without any crispness.•60 fps video recording at 4K is not there at rear cam, but is present for front cam. Don't know why they did that😅•Premium user-experience.•face unlock and in-display fingerprint is good.•Phone lacks a true premium feel due to the plastic frame.•The signature slide button delivers the same good experience.Okay, so if you feel that you need a 5G chipset and be future-proof, definitely go for it. If you want a flagship perfomance, go for K20 pro or OnePlus 7T as this wont be a good choice for heavy users, but still a good experience in regards of games for a short-run(COD in high graphics and frame rate ran smooth without any sudden frame drops, because it got an overclocked GPU). StillI am satisfied with what I got here✌️*UPDATED*•Excellent charging speed(Thanks to Warp charge, 10 to 100 in less than an hour)•Battery backup is so good for daily users. Lasts almost a day.•No serious heating issues at all.•This is a mid-range phone(one of the best) and should not expect a monster perfomance from it.•One of the best choice as a daily-driver( If heavy perfomance is not your priority)\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Heavily disappointed. So much of hype and the camera is not even upto the mark. Grainy pictures, looks like I have applied some kind of filter for my selfies. There is no way to undo it. The haptic feedback is good. However, there are several bugs on this phone. Hoping that they will get it fixed with an update! Also don’t panic and nitpick with screen quality! Looks great to me!But don’t  fall for the marketing gimmick. OnePlus promised something extraordinary and they have failed. Also, there were several troubles while registering my phone for the Red Cable Club. But several attempts and a complaint with the customer care, it was solved.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Got it delivered yesterday , used for about 5-6 hours , to tell you this is my first mid ranger previously I was using s9 plus , before that s7 edge and iphones in stone age .My first one plus , a mid ranger , I assure you it's no less a flagship experience , forget bout negative reviews, no device is perfect .This one has looks , power and performance , don't know how useful is 5G modem but who cares that's the baggage we consider it as of nowCamera unit is also awesome perfoms well and remember it's a bloat free and advt free experience of OXYGEN OS .Cons , I am yet to discoverENJOY the NORD\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I bought this phone for augmented reality purpose. They even launched it with the caption \"World First AR launching\". But this Nord is not supporting Augmented reality. I am damn fooled by One plus. Totally disappointed for my long wait. 500 rupees is wasted for prelaunch.AR is must and should technology in 2020phones. Even 10K phones are giving better support.Why One plus released a skull without brain. So I return this worthless (for me). Waste of time.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  An amazing phone!Got it delivered today and also received red cable membership which was unexpected.Formally had a one plus too and in comparison this one could've been a lot more better.The silicone case that came with it however, has the most horrible smell. Wash it before using it on your phone.Camera could've been a little better.The touch is not as smooth as the other one plus phones.Fast as hell.Colors are very vibrant.Does not have a notification LED. or a earphone jack.The grey is very attractive. Blue will be better.Will update on display issues (claims by many) after a month's time.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Front camera is very bad , and low light photo is also bad. Need update in camera section. Worst camera. I was also excited about this product like everyone else because I was going with the one plus brand. But if u r investing 28k for a mobile then it should satisfy your basic average needs at least. The camera quality is below average. 1 rating giving only for this. Otherwise features are good.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  ProSmooth OS - no lags at allAMOLED screen is good quality screenPrivacy - no useless apps like those found in chinese phonesAll other pros we would expect for these specs - no deviationsConNot a metal frameCPU is slower compared to current 865 flagships (this is expecetd)Note: I am releived the display is fine at low brightness - I read  some users sharing the green tint issue.  I did not face that yet.  Will update reviews in case of any issues.\n\n  \n"}
]