[
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This review's to all those who were eagerly waiting for the phone to launch and get hands on, but before all it's always hard to get the \"DEMO\" at the earliest so.. \"IMAGES\" above are to those who can't find demos much often/needed color/to avoid contacts at stores during Covid.Pros - Leather back warmth feelCons - Back Camera's not upto the mark when compared to the phones in market and of this price range, though it has given a sleek and leather finish with minimized thickness. . It's pro fades out its Con so can go for it blindly but only if you think \"CAMERA'S\" not your \"PRIORITY\"Features I thought would be there was 9.1 surround music/Dolby Atmos but it comes with:Real Sound Technology, just have a look into it if you're specific2. Super Amoled+ Display.Hassle free(Inside the box):Tempered glass comes on the phone itself so no extra work on fixing, which might sometimes go wrong.2. Silicon back case (if you're looking for touch and feel of leather back, better not use.. but use a side bumper if available for protection) Do also post where we can find side bumper, cos it's hard finding for new phones.. Thanks!Looking for a Standout design in 15-20k range? Then, \"GO FOR IT\" that's Value for money!\n\n  \n"},
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Hi, I am writing this review after 3 days of usage1. Firstly thanks to Amazon. Got delivered at a lightning speed. Ordered ok Saturday. Launch date was on 21st September and got delivered the same day at morning.2. Now about Oppo 17, this is very light weight, speed is good, I ordered dynamic orange. Trust me, this is the best and attractive colour I found ।l, blue is a good option too if you don't like a funky coloir।3. Camera I did not found upto the mark . Night mode is not that great but yes if you are a selfie person, go for it. I was using Ralme Xt earlier and it's camera was much better. But ok I will manage . I am a part time photographer and often I use my phone to click pics. Realme supported me a lot. Let's see how much Oppo supports.4. Speed is good. 6 GB 128 GB. Good combo. No lagging till now. Going smooth.5. Touch is awesome. Phone gets unlocks quickly. No lagging here too .Rest I will use for some more days and come back with my reviews again.\n\n  \n"},
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  i like the camera quality, images and videos are sharp and clear. there is a wee bit of noise in low light areas but it can be overlooked.it looks quite a bit like the iphone X but is largerdisplay is on par with iphone xmusic sounded as good as iphone xi could just unbox and get on with it as oppo provided the tempered glass, back cover as well. which was a pleasant surprise as I was not expecting. 😄Also the design, finger print sensor on display, face recognition .... lot of features.dual 4G standy by with an SD card is a blessing and I was looking for exactly what this phone offered at the right price and also the back cover made  of leather is so freaking rich and classy.quite happy with what I got. This is probably the fastest decision I have ever taken around buying a phone and I am hoping this will last long, like most of my other phones.\n\n  \n"},
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  So it's been three days since I'm using this phone and I'm completely in love with it at the price I got.1. Weight of the Phone is very less when compared to any phone in this segment and this matters a lot to me while carrying or casual music listening or any stuff.2. Back leather type wrapper is really good and gives a premium feel.3. UI is also good in terms of usage and mobile handling and compatibility4. Camera is decent for video calls/ normal phots not that great especially for shotting long-distance objects/ sceneries. But this doesn't matter to me a lot. Come on use a professional camera if you want photography at peaks.5. Design is excellent and it is the slimmest phone at 7.43mm6. Build Material quality is good.7. Sound is good but not that great for melodies or any songs please use earphones/headphones.8. Display is really good and it's out of my expectation as I'm using Samsung AMOLED previously.9. Processor is fast for general purpose and played COD and some other games at medium graphics didn't observe any lag.10. Battery is okay and keeps you charged up for one day (General usage with low- medium gaming)11. Software is fast and no clutter apps or extra apps.Overall I would definitely recommend if someone wants a nice phone for general usage which looks classy.\n\n  \n"},
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  1st Buyer  of OPPO F17Awssm back leather and fantastic phone camera is very excellent\n\n  \n"},
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Hi I got this phone 24 sept morning .phone is good and light weight so I love and purchased this.but this phone big point is it's not played videos like 4k videos and hd plus videos properly I can't understand this is which type of mistake is.oppo brand must solve this soon as soon possible. I also talk to Amazon customer care unit they arrange technical assistance he come 29sept  . Then let's see what type of problem is . I use before realms xt Samsung m21 and 31 they are best one chooses this for only of light weight and design ... Totally at that point disappointed ...hope to solve this problem ..........\n\n  \n"},
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  There is no inbuilt call recording&there is not inbuilt call block application without this why should we purchase oppo।very bad experience with oppo now with this purchase\n\n  \n"},
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  CLASSY PHONE FOR CLASSY PEOPLE, IF U LIVE A MEANINGLESS SHOW OFF LIFE, TAKING SELFIES AND PICS THEN U WONT LIKE IT AND IF U CANT AFFORD A XBOX/ PS4 AND LOOK TO PLAY GAMES IN PHONES THEN OBVIOUSLY U WONT LIKE IT , AS I SAID ITS CLASSY PHONE FOR CLASSY PEOPLE, IF U WANNA USE A PHONE LIKE A PHONE THEN ULL LOVE IT If u are looking for dslr in phone and xbox and playsation in phone then buzz off, u will never understand what class is all about\n\n  \n"},
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It is nice phone but it is little bit higher cost than expected in these segments\n\n  \n"},
{"Brand": "OPPO", "Model": "Oppo F17 (Dynamic Orange, 6GB RAM, 128GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It's not worth for this amount after Unboxing and using it for a moment I feels like that, because I am using oppo mobiles more than 3 yearsBut this product is okay by weightless,fast charging  but not okay with with cameras,finger print accessibility, battery performances,And processor is snap dragon 662 nothing more specific things .So oppo have to launch little bit better quality product for this amountDynamic orange 🍊,first you realise the colour of orange and this phones colourDon't try to give fake colour or spread fake informationsSo I don't suggest to buy this product to anyone\n\n  \n"}
]