[
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  There is no phone inside\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n   Don't buy this phone please!It has red tint,black crush and black bar issue which is a hardware issue and can't be fixed with a software.Please dont waste your hard earned money.People who are saying the display is perfect have not done screen tests on dark mode.Below 30% brightness there is color shift,high contrast scenes are really bad whether on netflix,prime or youtube.Hdr content is plain horrid,it seems like a grey filter is present always when watching hdr content.And no before you think its an isolated issue only affecting certain devices,please check reddit or oneplus forums.Oneplus has chosen to not reply regarding any of it.I will say it again its a hardware defect,please dont think an update could fix it.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Pros - everything is perfect except display. Trust me this phone is a beast.Cons -Day 1 - No display issue noticed, did every testDay 2 - Black bar is visible in in Dark tone theme on chrome and lock screen.Day 3 - Screen flickering issue and colour retention issuesNote - You will never going to see any issues if you don't use Dark tone theme.Expert says Amoled display has limited life span but if you noticed issues from beginning then it is not a good sign it can be worse day by day. Specially if it has manufacturing defects.Price is 55k for the phone but it's not worth with this faulty display. Nobody has this much time to visit service center now and then. Even i tried to call customer service but my call is on wait for 1 hour no body picks up so who will be responsible for our device problems?If this display issues can be solved then they would have been solve it in past 2 months\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Facing major problems:1. Black bar, black crush issue and red tint across the display. ( Attached photos for reference)2. Significant discoloration on display with uneven brightness. ( clearly visible in the photos)3. OnePlus has tried to dampen the issue by increasing the minimum brightness, now its uncomfortable to use in the dark, with so bright screen glaring at you. ( Trying to get away)Seems to be prominent in the Indian unit.No response from amazon or OnePlus till now. This is totally unacceptable. Your silence on this is shameful.For you it might be just another phone, For me it is hard earned money that they I have saved up for monthsHighly disheartened with this purchase.Request to Replace or Refund this purchase.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Edit 2: After 4 replacements , Amazon said that OnePlus is having a manufacturing defect(display) , gave me a refund and said to buy any other phone and not the 8Pro and I don't recommended to buy this to you as wellEdit: this is my 2nd order and it is still defective , very bad , returning againVery bad Quality control!!, returnd the product\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Worst phone getting overheating message very often, battery is draining within 4 hours, display is blurred and there are bubbles in the display. Received used device.Camera quality is also not worth it its very bad.Please don't waste your money buying this.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The outer looks of the phone is just delightful, SD865 is just wow!!. Started seeing some black bars in lower dialer screen with default wallpaper and also in chrome browser. Front and rear camera really sucks. Camera seem to be ordinary as <15k budgeted phone. Battery is really utter waste thing with less usage it lasted for 4 hours. If someone is looking for great flagship. Never go for this. You will regret for the rest of your life. I was amazed by the youtube review videos about this phone. But it don't deserve to be a flagship phone. Most features are just a gmmick to attract customers. Green tint has not been fixed yet. Everyone who buys this. Please check it thoroughly by sliding brightness where you can see RGB tint. Am returning it for refund.CAUTION: Never buy this. If your are looking for a great camera and battery. Numbers seem to be awesome. But they are not up to the mark. This is my honest review on this. Rest is upto you.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  A black bar on the top of the display, also the phone start to show image retention problem. I don't know whether it will be fixed in updates.There are just 30 percent chances that you will get issue free device.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The green tint and black crush issue hasn't been resolved. A horizontal bar appears on the top under the front camera notch. Green patches are visible under low brightness and 120Hz. This is a hardware issue. Please return your product if the same issue persists in your device too. Going for iPhone now\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 8 Pro (Glacial Green 8GB RAM+128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I had been waiting for this phone for 2 months, but I was utterly disappointed when I finally got it in my hands. OnePlus has been evading defect screening apparently, as I got a screen with dead pixels. You can see the black spot at the edge of the screen. Really disappointed with the OnePlus operations.\n\n  \n"}
]