[
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  For 25K , you will get- Average performance. Already Chrome hanged couple of times.- Single Mono Speaker, which gets blocked since it is downward facing. Sound quality is not good- Good Camera but it should improve with sw update, since hw is capable.- Below Average Battery. Reducing to 60Hz refresh rate would help.- Good Build Quality .- in-screen Finger print sensor is OK-OK.- Useless 5G- No battery indication or notification led when screen is off. You have to tap button to see these on screen.  I am fan of stock android feel , one of the reason to buy this phone . I am not a gamer. I was using One Plus 5T ,5T is giving similar performance. Hence if you are using 5T or later and you are looking to update then don't think about it.  Removing unused Apps is important to save memory since this model is 6GB/64GB.  5G is useless which you are paying for. Irony is by the time 5G comes , this phone will be become slower and battery issue will be more prominent . My last hope is on software updates. You can save money by buying phone less than 20K which will give similar performance. One plus forgot what they were best at. Now they are trying to bring flagship product with flagship price like oneplus 7/8 . One plus brought Nord to bring their original customers back but Nord does not live upto expectations. It is half hearted attempt by one plus to make Nord as flagship killer.But it has failed since one plus are making their own oneplus7/8 series flagship phones which they do not want to kill. At this price( 25K +2k for BT headphones), this phone is neither a good budget phone nor flagship killer.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The phone is really great performance wise, the screen pixels are amazing. But I'm not much satisfied with the storage. I recently purchased it in 6GB+64GB, and the system storage is 20 GB one which I can't do anything. If 20 GB is what you are giving and 64 GB I'm buying all I'm left with is 44 GB. And after installing few apps it's almost 35-40 GB. So what is the point of buying a phone with such less storage space.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I have been using it since 14-15 days. So here is a short term review of the phone.Display: Fantastic, fluidic display. Didn't face any tint issue.Battery: Getting 8-9 hrs of SOT even with 1-1.5 hr of casual gaming.Performance: 90 Hz ref rate makes app opening, scrolling super smooth. No lag faced during gaming, scrolling through social media.Camera: I don't use the camera much so can't comment about this aspect.Few cons I have come across are :1) A bit slow fingerprint scanner.2) Slight heating during charging and extended gaming periods.3) Didn't find appropriate customisation options for font.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Such a nice phone from one plus.over all it's good.But price is aggresive.camera quality is average.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Regarding the one plus feeling. It's gone..See how they sell their 6 gb 64 varient through flash sales. Yy the blue varient is not yet available for sale in base varient after 2 Months.1.5 month waiting for buying base varient.. Geat!Just one answer they are trying to make every bit more by selling higher varient. Forcefully making people to buy their higher varient even when selling point advertised is still 25k.I own a one plus 5 and I was still impressed with that phone in every aspect camera & performance.Regarding the nord. The front camera is just waste. Not even half the quality when compared to 3 year old oneplus 5..great oneplus..Their was a feeling of giving the most with every penny spend from oneplus till now.. It's gone and never gonna get that trust back from people oneplus.Writing on - how long waiting for a phone and the struggle to get a phone one flash sale + phone issues.1+.. It would be better to look back how oneplus earned this place. And loosing the current stand doesn't need any other reasons.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Do not buy thus Oneplus Nord mobile, this is having auto reset and auto rebooting problems. I am struggling to get my refund.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The camera department have so many problems it over smooth all imgaes and a lot ! And please don't even considering buying the 64gb variant it 22gb for software and bloatware apps . I suggest to go for Samsung m51 or Google pixel 4a\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Display tint issue? Yes, but not noticeable. And btw it not an issue, it just characteristics of AMOLED Display. So if you are not sure to buy Nord for this display tint. Trust me display is awesome. 90hz is much smoother!About camera. Front 4/5Back 4.5/5Best NightmodeUse with Gcam💥Processor. ⚡4.5/5Battery 4.5/5Strong reasons to buy: oxygen OSMan it feet like you are using 2030 smartphone! Go for it.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Everything is fine, 765G is really good for battery. the one thing that annoys me is 64 gb is way too low storage, where 20 used by system itself and then welcome to bloatware ..u can't delete apps like Netflix and fb or some of google app which is really useless. I barely use Netflix on phone. after all that u get only 35 gb of use. There is also some technical glitch regarding to onePlus's  so called 50 gb cloud storage, I m still unable to get this benefit including device protection through oneplus care.Camera is superb as expected. display is in the top notch. charging is awesome i.e. really fast.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus Nord 5G (Gray Onyx, 6GB RAM, 64GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Not a flagship but the best mid ranger📷 8/10 (macro poor)Display 10/10Processor 9/10Battery 9/10Sound 9/10No lag ....no heating issue ... no tint issue...once you use a OnePlus phone then you don't like any other phonesOfcourse pretty much everything you could ask for\n\n  \n"}
]