[
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Phone looks good but price is little high\n\n  \n"},
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The phone is awesome!\n\n  \n"},
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Greet price\n\n  \n"},
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It looks so good.....its Samoled display gives you very clear view . While gaming it get little hot . Its good phone under 17000rs .\n\n  \n"},
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  After using the all new Samsung Galaxy A30s, i truly found that this is a nice little budget phone for day to day consumers. It has got a decent battery backup, display's amazing (first time using an AMOLED display), the triple camera setup is quite useful and has good color reproduction but it somehow cannot try to get a good shot at night. I mean the pictures are not so bad, but there is definitely some tuning required to make the camera take good shots at night. The fingerprint reader is very fast but be careful to use a certified and original screen guards or protectors as the fingerprint does struggle in screen guards. The back glass design is just awfull. It shines out real hard at bright lights. Included accessories are a pretty decent specially the included fast charger with the Type-C cable pretty sturdy. Overall this phone is a good competitor against chinese manufacturers.PROS:--Supports fast charge and has pretty decent charge rates-Has NFC which enables in wireless payments and support for Android Beam (unless Android 10 comes)-Has a good 4000mAh battery, pretty decent for bit of heavy users-Has on-screen fingerprint which is good-Camera setup is goodCONS:--Camera struggles to shoot better pictures at night-The included night mode requires a little bit software upgrade-OneUI which is extremely good, but the icons are kind of kiddish-And mostly- Where is Bixby voice assistant?There is bixby home though but this phone does not support Bixby voice assistantOverall the cons are not a big factor.Most of the cons are fixable by latter FOTA upgradesSo if you are looking for a budget option, go for itThis is my review after using the A30s for 3 months. Firstly speaking, samsung claims to have a 4000mAh battery, which sounds good but use it and you will feel that it is not actually keeping the charge for the required hoped time. I mean, typically a 4000mAh battery should last for 1 and a half day easily. But in this, it hardly manages to go through a day. I had to dip the phone in the charger atleast two to three times a day. And strictly speaking, i don't play heavy games like PUBG or COD. I am just a day to day user. But you cant complain if the phone charges in 45 mins. Another thing i want to mention, please keep a 4D tempered glass screen protector otherwise a single hard drop in that AMOLED screen will cause a good beautiful crack in the screen. Also i feel like the speaker of this phone is not upto the mark. Like, i've used budget phones like realme 3, Asus zenfone max pro m1, Asus max pro m2, redmi 7a.All of them had such beautifull sounding speakers. Compared to those, it is nothing sort of. Also, the fingerprint get's slow as you use it. It feels very slow. But despite all of these, samsung strictly gets a plus mark for it's awesome update schedule. And yeah, one ui holds my favourite ui spot still. And one more thing to say to all those who had bought it and also those who are going to buy it. If you feel like the glass back design looks just awesome(specially black one), just go ahead and fall in love with that design!!\n\n  \n"},
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This phone is just Lit 🔥 value for the money... camera would rate10/10 battery 10/10 even after heavy useage it would last for a day this phone is best for gaming it would slightly heat up that's common for every mobile phones.... Most loved part in this phone is fast charging ♥️🔥✌️. And missed one part that is it's mobile security when you try to turn off ur mobile it asks for a pin or fingerprint....... just think ur mobile got stolen or lost.. if someone tries to turn off it won't coz it asks pin that's impossible for thief to crack it♥️🔥🔥🔥\n\n  \n"},
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Worst phone very slow. Don't buy. I'm very disappointed.\n\n  \n"},
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Good product.Has samsung pay NFC ONLY no MSTUses the exact same great camera of a50And even the body is same as a50 , finding covers and screen guards wont be a problem .Battery backup is decent and lasts one entire day.Performance is decent,  amoled display is good too.\n\n  \n"},
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Not catching signals properly.Finger print sensor is also not working properly some time after two or three attempt it read\n\n  \n"},
{"Brand": "OPPO", "Model": "Samsung Galaxy A30s (Prism Crush White, 4GB RAM and 128GB)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Love the samsungProud to be a Samsung user love the design love the display yeah fingerprint sensor is little slow hope this will be improved by the upcoming updates\n\n  \n"}
]