[
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I am fully impressed with this phone after 2 weeks of usage.I was using a LG G3 before this and had to buy the phone because of a pcb board failure.( had also replaced the battery last year)Within 3 weeks I had done my research on various models at various price pointssome of the phones I considered wereMoto G5 plus----> excellent reviews all over, but camera is a compromiseMoto Z play------> good battery life...but specs wise ok and additionally it is made to support the moto mods so design looks funny with the pins at the backHonor Pro 8----> phone has some heating issues while using cameraOne Plus 5---> other than jelly effect no significant issues seen on the internetIPhone 6S ----> if IOS fan, then go for it but take the higher memory version as 32gb is too small for Ios apps.IPhone 7----> camera not as good as galaxy s8 , pixel or one plus. please see the comparisons online. why spend so much when one plus 5 is available at nearly half the priceLG G6 & Samsung S8---> did not consider Korean phones especially after my experience with G3.coming to the phone usage. I will not speak about the specs as most reviews highlight it in detailwhat I liked!Blazing fast  while opening closing apps etcCamera is quite good! I would not rate it as good as pixel, but produces very acceptable quality in most lighting conditionsdesign is very slim. fits comfortably in one hand. but I would recommend a case as it is slippery especially while trying to take selfiesVideos are with Electronic image stabilisation ( 4K too) which is brilliant!Dash charge is very good!latest OS 4.5.8 update is available also to downloadwhat I dislikedCamera app is very basic. not so much customisations such as gesture shutter. there is a smile shutter which is too responsive and clicks away!Gallery app is also very vanilla. although we can create collections, it cannot be uploaded to google photos.Battery life is a question mark especially over 2-3 years as currently even with moderate usage It gets me through a day ( but most phones have this problem so its not a deal breaker )Display legibility is not great especially under direct sunlight. this could be corrected with adaptive brightness but then indoors it becomes too bright.so drains the batteryOther than display legibility most of the above cons can be fixed by software updates I guess.I have also uploaded some pictures I took under different condtions. please note that I did not set any condtions or modes.I just pointed and shot as I am no expert in photography :)overall I am very happy with the 2 weeks I have used it.Without any fear , go for it!\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I was bit tensed before ordering it bcz it is huge amount amount for me(I'm student) (33k). But my parents told me not  worry buy it. I ordered it & received within 2day of order hatsoff to Amazon for that.*Pros- 90% Charging in 60Mins. If you use phone only for  whatsApp & Social meadia not gaming Charging last for more than 10hrs With 4g- Camera Quality is more than Superior- Everything is too good.- using for More than 15 days not single phone lagged or heated!*Cons- Portrait mode Sometime is not effectedBesides that phone is above your expectations!\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Pro:1. Quick processor2. Nice ram management3. Ultra fast storage4. Unparalleled DASH charge5. No heating during multitasking/heavy usage.6. OOS 4.5.x looks and feels better than the version in 3/3T. I am sure the little issues will be taken care of, soon.7. AptX support for better wireless audio.8. EIS - the hype is real. Works better than OIS.9. Camera is better than 3/3T. Videos look great after update. Decent front camera. But more on it in cons.10. Amazing battery life.Cons:1. Speaker is louder than 3/3T for sure but sounds cheap.2. Sound via headphone jack is also better than 3/3T, but lacks the power to drive high quality headphones.3. Inbuilt equalizer is the worst there is. An update can easily fix that.4. Dual camera setup. OP should have opted for a wide angle combi instead of zoom. That would have been more useful. Pictures in low light are still noisy. Bokeh looks artificial/overprocessed.5. The screen isnt as bright as 3/3t. Legibility under sunlight can be an issue for some. Also, same old 1080p can be a bummer. I personally dont mind the trade off for battery life.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  1. Processor:The OnePlus5 is the first phone in India to have the advanced Octacore 10-nanometer design Qualcomm Snapdragon 835 chipset. Combined with the 6GB (or 8GB for the 128GB variant) of RAM, it can not only render graphics faster but is also more battery efficient.2. Camera:OnePlus5 also comes bundled with a dual camera setting. While the front camera is of 8-megapixel, the two rear cameras are a combination of a 16-megapixel lens and a 20-megapixel telephoto lens.Both the lens is made by Sony and the primary camera has an aperture of f/1.7 while the secondary camera has an aperture of f/2.6. The telephoto lens will offer up to 2x zoom and both the lenses will combine together to capture impressive photos with a greater depth of field, akin to the portrait mode of the iPhone 7 Plus.3. Dash Charge:In the fast paced world, the faster the phone charges, the better it is. And the OnePlus’s Dash Charge proves that point beyond a doubt. Just like the OnePlus 3/3T, the OnePlus 5 also comes packed with the mighty Dash Charger.The Dash Charge is capable of charging the phone from 0-60% in just 30 mins and that’s more than impressive.4. OS:The Oxygen OS software has been updated to Oreo in the last week that we have been using it. It adds some light, useful and tasteful customizations on top of stock Android that add value. It’s not easy to get the software right and it’s impressive how OnePlus can strike the right balance so early in the game. I particularly find gestures (including alternate actions you can assign to navigation keys) and the left home screen pane very helpful.5. Battery And Audio:The 3300mAh battery on the OnePlus 5 can comfortably last for one moderate usage day. On particular heavy usage days, you will have to resort to mid-day charging. The Dash charge is incredibly fast as ever and will prove to be a big convenience. It, however, works only with the Inbox charger and cable.The loudspeaker on the phone is present on the bottom edge. It’s quite average in terms of loudness but the audio quality is reasonable. Audio output via headphones is very good. The call quality on the phone is excellent.But After So Much Some Things Got Missed Like*OIS Camera Stabilizer*Not IPS Certified*2K Display Resolution*Also Dual Camera Needs Some FixesBut over all its a power packed phone with a reasonable price.#And 5T has made some improvements on camera which are missing on 5 but Front Fingerprint Scanner lover chosse Oneplus 5 😉.Thats all, Hope I have helped a lot.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Using this phone from 1 week. Faced no problems. They have given lot of shortcuts and options for user friendly experience. Don't use this phone without back cover. Once you add a good back cover it is very handy. Camera of one plus 5 is best in this price range. Dual camera really makes a lot of difference. Avoids noise because of 2x zoom. Front cam is also good. Battery charges very fast and you can get along a whole day with it. Sound quality is also good.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Dash charge is very fast, within 30 min it will be enough charged, but the software upgrade is little buggy, some apps gets crashed and a popup comes in saying \"___ app has stopped, open again\",camera in day is excellent, but night needs improvement.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Great value for money... you will never be disappointed.Here are my reviews after using 2 months..Looks.: Look is of flagship grade... little bit slippery,so u need to buy back cover to protect it..rating:8/10Display: Display is much better than any LCD but not as great as samsung super AMOLEDs. Rating: 8/10Performance: For this only one word.. awesome!!! Great performance...no heating at all.. blazing fast processor..iam loving it's speed..rating 10/10Camera: Nice camera.. Daylight photo quite good(samples attached).Night photo though manageable but not as great as samsung flagships..but still it beats it's rivals(honor 8 pro). Selfy photos are very nice..no complaints at all. Overall a great camera... rating:8/10Battery: Great battery.. easily lasts whole day despite heavy use and dash charging is like Cherry on the cake.It charges the phone from 25% to 60% within 15 minutes.Awesome...only problem is you have to take charger and adapter to avail dash charging.. rating:10/10Sound: Very good loudness and sound clarity from the single speaker...with headphones too. Rating:8.5/10Recommended to buy if you want overall a good package within the price range...it will not disappoint you..\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The mobile display on the screen has vanished and no images are visible on the screen even when the instrument was used sparingly  for watching videos on you tube since it was delivered to me on 28th June(only two months back). On making a search on google it appears that many other buyers have also faced similar problems with this model.It appears that there is some manufacturing defect and therefore the instrument needs to be replaced immediately.I have already lodged my complaint (No.1402504 dtd.29.8.2017) with the customer care department.of the company.I have been given to understand that the instrument will be repaired free of cost.But since the malfunction/damage has occurred within the warranty period of One year I would like the instrument to be replaced forthwith.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Writing this review after using the phone since August-17. It was difficult to get into Android after using iPhone, but never regret this buy for the below points.1. Finger print sensors are with good speed.2. Faster application speed than all the other phones, found better speed than my iPhone 6.3. Good app interface, can't beat iPhone in this aspect, yet 1+ doesn't compromise.4. I have installed 200+ apps and yet it doesn't hang for any games. Games like assassin's Creed run real smooth.Recommend to buy it if you are looking for a phone below 40k.\n\n  \n"},
{"Brand": "OnePlus", "Model": "OnePlus 5 (Slate Gray 8GB RAM + 128GB Memory)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I am posting this review after using the device for almost 30 days and I would like to divide my review into pros and cons.(Using 8 GB ram variant)∆ WHAT'S INSIDE THE BOX ∆The box looks like any other mobile phone box , nothing much fancy .Inside the box we get1) Device itself2)User manual and some paperwork.3)Dash charger and cable.∆ PROS∆1) Design-It's a pro or con depending on each user's, if you look pass the Appleish design the build quality is amazing .It has curved back which feels really good when you hold it in hand.2)Top notch specs.3) Stock Android with minimal bloat and fast updates (I have received 3 till now)4)No-heating issues-I have used this device for many days and I must say this device barely heats up while doing intensive tasks, thanks to the Snapdragon 835.5) Excellent Camera-Day light photography is excellent but in low light it's a hit or a miss.6)Fast fingerprint scanner.∆CONS∆1) Display is still Full hd2) Battery is not that great even with Full hd display (This could be fixed with an  software update)3)No Sd card slot.4) Price could have been less.Overall Iam pretty happy with the device and I highly recommend this to anyone over honor 8 pro.Thanks ✌️\n\n  \n"}
]