[
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Don't ever buy Redmi mobile,  I purchased it 3 weeks back and there is problem in the display.  Company is not even replacing the product now.  Entire money gine waste.  Don't ever buy any of the Redmi mobiles\n\n  \n"},
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "2.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  It’s mentioned that there is FREE: Headphone + Noosy Pin + 2 pin 3.5mm Audio Jack + OTG + 3.5mm Speed Cable. But other than Noosy PIN, there was no Headphones or OTG Cable.\n\n  \n"},
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The volume key has stuck inside the phone, and unable to use it. Its Kind of Bend. I have checked on internet and saw so many similar cases. It has to rectify while manufacturing itself. I have raised case replacement but the process is like painful. Technician will take 5 to 7 working days to visit you to see the issue, once he sends the report to seller then they will proceed for replacement. The whole process takes 20 days approx or even more it seems. Mean while I booked this via No cost EMI offer, Now that also getting affected like once you raise replacement case, the Initial contact with back will be terminated and  for that bank will charge some money it seems. And again new contract will be made for new order or replacement. Even though issue was from seller, customer also need to suffer. Its very Bad!!\n\n  \n"},
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Accessories that were promised were not delivered. The parcel contains only the phone, the charger and the sim ejector pin.\n\n  \n"},
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  I got this mobile 15 days back. Now I am facing issues with this mobile. I need a replacement for this defective product. Whom should I contact for replacement ?\n\n  \n"},
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  This phone to be bad not touch work thisPhone touch not work\n\n  \n"},
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Problem - 1. even in full call volume, the sound is not clearly audible2. Sometimes hotspot doesn't work properly3. Note6 pro is launched at lower prices with higher features!!!Good - screen, battery, processor, camera all are great except above\n\n  \n"},
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  When I got the box, clear soft case(is missing) in the box, although it's mentioned on the box. I have attached the pic of the box. This is ridiculous for cost cutting, they are reducing the in-box accessories. Overall phone is good with camera and performance.\n\n  \n"},
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Good & Amazing phone!!!\n\n  \n"},
{"Brand": "MI", "Model": "Redmi Note 5 Pro (Rose Gold, 6GB RAM, 64GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  The screen shows vertical lines.\n\n  \n"}
]