[
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  After using almost 1.5 days of this phone. Here I am sharing the pros & cons related to oppo reno 4pro.Pros:1. Design: Its a killer look, definitely gives a premium look (5/5)2. Display: Its awesome 3D edge smooth & bright display looks more premium (5/5)3. Camera: It's good. the front camera is better than the rear. (4/5)4. Sound: Awesome sound while listening & watching movies. You can enjoy 3D Dolby sound, Theater sound. (5/5)5. Battery: Its cool, not draining too fast. The main thing is charging. It's really very fast. (5/5)Cons:1. Sometimes the upper back button is not working due to edge display2. While using dual SIM you cant identify message info (it's for sim 1 or sim 2). Its quit disappointment3. Night flare is not available in selfie camera\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Phone is good but is getting hot may be due to first charging. Let's see after 2-3 days what happens. This is the first impression. Charging is so quick,it's  amazing.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Reno4 pro phone truely feels like a premium phone. The infinity display (edge display or 3d curve) makes this phone stand apart from all the other phones in this price segment.The phone also has a great feel to it when holding (it's really thin).Now coming to the usage part:Display (5/5) - the dispaly is really good I think the 90Hz refresh rate would have a hand in it.Charging (6/5)- the best aspect by far, the 65W charging is really awesome and charges the phone really fast.Sound (5/5) - the sound is really goodCamera (4/5) - camera for this segment is also really good stand alone (maybe a point less as compared to Reno3 pro).This is the intial review or this smartphone, I think it really does justice to the price point.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  At the onset I would like to express how unsatisfied I am as a customerafter purchasing OPPO and the series of instances that have taken placeover the past one week.I am writing this as it happened:After a few days of usage of OPPO Reno 4 Pro, I started facing issues.Issues pertaining to lag while using Google Chrome, Generic apps andswitching between multiple tabs, I was completely unhappy with the productand I could clearly see the lack in  performance. When I flagged the issueon the 12th evening to Amazon services, an online tech diagnostic processwas initiated and later I was informed about a technician visiting mylocation/ residence on the 14th afternoon. (I was told that the returnwindow shall be extended for further 10 days as the product is beinginspected)When I tried reaching out to the technician, my calls were unanswered ( 6to be precise) and later that afternoon one of the tech representativecalls to inform me that the technician will not be  visiting and ifenquired by Amazon, I was requested to say that the visit was successfuland promised a refund process.Again after one day of no response, I made an effort to reach out to Amazonand explain the entire issue and now is where the Amazon agent clearlydenies to take any responsibility for after sale customer service anddiverts me to get in touch with OPPO directly. After numerous calls to OPPOand with no response from their end I had no place to go but to come backto you.After a long call with the amazon tech team, the young lady understands howunhappy I am as a customer using a phone that's a downgrade and going toand fro resolving this. As a protocall she assigns a technician visitagain. As per the technician who did visit, agreed that there is lag in theusage but that's OPPO for you and signs off saying he'll have to resolvethe ticket, booking this under working fine.This is the entire narration of a series of events over the last 10 days.Here's how I feel.Absolutely Unhappy, first with Amazon having to reachout to express andexplain about my current status and give a download of a series of eventsthat's happened every time over a call again and again, Secondly usingOPPO, with its performance, Pathetic.It has taken a lot of mental stress going to and fro on this purchase withthe customer care.*I would request Amazon for a refund (within Amazon wallet) for thisproduct* as it's within the Return window : 12-Aug 2020, Later extended 10 days and I don't want to invest any further time on this.As I end, I would like to ask Amazon just one thing.WHAT IS MORE IMPORTANT ? HAPPY SATISFIED CUSTOMERS or THE POLICIES ?Thanks\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "5.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Phone is very gud and very lite.It's built quality is greatIt's biggest TRP is it's 3d curved glass which gives premium lookCamera is great too specially slow motion capture and colour filterSound is loud and clear.It's super voc charger is a monster which charges your phone in approximately 30 minutes.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Pathetic phone, at this price after a week it has lost volume if i shoot from rear camera & from front camera video volume has also come down, Amazon is not responding properly to my complaint, lost hope for replacement.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Delivered on time. Product is good. Felt Little overrated. But my SIM didnt work in one of the slot. While the same SIM is working in other mobiles.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Some camera samples\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "1.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Pros and consPros:- 1.Phone is actually decent in looks and low in weights.2.Charge the phone very fastCons:- 1.90hz mode giving you problem.1.1 battery problem1.2 slow down the speed1.3 A night I saw my phone automatically switch off.2. Front camera is not decent3.Anonymous apps downloading behind the services from play store but when I saw play store there is no any thread working on downloading and updating the app(color os 7.2 unstable behaviour and privacy concern).4.not a value for money5. You can not work high End apps,just think twice from devoloper End and Client side.6.its normal Android phone like redmi note 8,there is no rich feeling instead of looks.7.Please don't buy your money value matters.\n\n  \n"},
{"Brand": "OPPO", "Model": "OPPO Reno4 Pro (Starry Night, 8GB RAM, 128GB Storage)", "stars": "4.0 out of 5 stars", "comment": "\n\n\n\n\n\n\n\n\n\n  \n  \n    \n  Phone look feel and charging are among the great features. Charging is super fast compared to any other phone in the market. However considering the price and features claimed by Oppo, the Processor is slow also 4000 MaH battery is bit less compared to the specs. Overall a premium mid segment phone is you can hike your budget just a bit you can get a SD 865 processor phone which is much faster\n\n  \n"}
]